{
  "compare_describe_and_order_measures": {
    "Year 1": [
      "Which is longer, a pencil or a classroom table?",
      "Which is heavier, a book or a feather?",
      "If you have a full glass of water and an empty glass of water, which has more?",
      "Who is taller, you or your teacher?",
      "Which animal is slower, a snail or a cheetah?",
      "Which is shorter, your finger or your leg?",
      "Hold a crayon in one hand and a bottle of water in the other. Which one is lighter?",
      "Look at two plant pots. Which one do you think can hold more soil?",
      "Which takes longer to do: brushing your teeth or eating your dinner?",
      "Is a giraffe taller or shorter than a cat?",
      "Which is heavier, a school bag full of books or an empty school bag?",
      "If you pour all the water from a small cup into a large bucket, which will look fuller?",
      "Is it quicker to walk to the end of the corridor or to hop?",
      "Which is longer, a car or a bus?",
      "Which is lighter, a balloon or an apple?",
      "Compare your lunchbox to a friend's. Which one is bigger?",
      "Who is the tallest person in your class? Who is the shortest?",
      "Order three friends by height, from shortest to tallest.",
      "Which is heavier, a potato or a bag of potatoes?",
      "Does a teaspoon hold more or less liquid than a mug?",
      "Which is faster, a running person or a person walking?",
      "Is a lamppost taller or shorter than a house?",
      "Put these in order of length, from shortest to longest: a paperclip, a pencil, a whiteboard.",
      "Which holds more water, a bathtub or a swimming pool?",
      "Which would take less time, singing a song or watching a film?",
      "Which container holds less: a water bottle or a paddling pool?",
      "Is a ruler longer or shorter than your arm?",
      "Which is heavier: a single grape or a bunch of grapes?",
      "Does it take a longer time to draw a picture or to write your name?",
      "Who is shorter: you or a baby?",
      "Which is lighter: a chair or a table?",
      "Does a bucket hold more or less than a teacup?",
      "Is it quicker to clap your hands once or to tie your shoelaces?",
      "Which animal is taller: a mouse or an elephant?",
      "Which is heavier: a feather pillow or a pile of bricks?",
      "Put these in order of time taken, from quickest to slowest: eating an apple, reading a book, blinking.",
      "Is a tree taller or shorter than a flower?",
      "Which holds more juice: a small carton or a large bottle?",
      "Which is lighter: a coin or a wallet full of coins?",
      "Is it slower to crawl or to run?",
      "Which is longer: a worm or a snake?",
      "Which is heavier: a single piece of paper or a whole notebook?",
      "Does a jug hold more or less water than a spoon?",
      "Who is taller: the school's headteacher or a student in Year 1?",
      "Which takes a shorter time: counting to 10 or counting to 100?",
      "Is a bus longer or shorter than a bicycle?",
      "Which is lighter: your school jumper or your winter coat?",
      "Compare the capacity of your water bottle and your lunch box. Which holds more?",
      "Order these from slowest to fastest: a tortoise, a person walking, a car on the motorway.",
      "Which is shorter: a pen or a crayon?"
    ],
    "Year 2": [
      "Order these lengths from shortest to longest: 15cm, 8cm, 21cm, 12cm.",
      "Use the symbols <, >, or = to compare the following: 500g ___ 1kg.",
      "A bottle holds 1 litre of juice. A glass holds 200ml. Which holds more?",
      "Put these masses in order from lightest to heaviest: 25g, 1kg, 50g, 250g.",
      "Circle the longest time: 1 hour, 30 minutes, 70 minutes, half an hour.",
      "Order these masses from heaviest to lightest: 1kg, 500g, 750g, 2kg.",
      "Use the symbols <, >, or = to compare: 1 litre ___ 1000ml.",
      "A snake is 50cm long. A lizard is 55cm long. Which is shorter?",
      "A jug contains 500ml of squash. A glass contains 250ml. Which contains less?",
      "Put these lengths in order from longest to shortest: 2m, 150cm, 1m, 210cm.",
      "Use the symbols <, >, or = to compare: 30cm ___ 25cm.",
      "A bag of apples weighs 1kg. A bag of grapes weighs 900g. Which is heavier?",
      "Circle the smallest capacity: 300ml, 1 litre, 200ml, 50ml.",
      "Order these heights: Ben is 125cm tall, Sarah is 119cm tall, Tom is 130cm tall.",
      "Use the symbols <, >, or = to compare: 100g ___ 1kg.",
      "A red ribbon is 45cm long. A blue ribbon is half a metre long. Which is longer?",
      "A bottle of pop is 2 litres. A carton of juice is 1 litre. How much more does the pop bottle hold?",
      "Arrange these weights in ascending order: 3kg, 300g, 1kg, 2500g.",
      "Which is longer, the school hall or the classroom?",
      "Use the symbols <, >, or = to compare: 75ml ___ 750ml.",
      "A pencil is 15cm long. A crayon is 9cm long. Which is shorter?",
      "Sam weighs 25kg. His dog weighs 30kg. Who is lighter?",
      "Order these capacities from smallest to largest: 1 litre, 50ml, 500ml, 2 litres.",
      "Use the symbols <, >, or = to compare: 1m 10cm ___ 120cm.",
      "Is a 30-minute cartoon longer or shorter than a 1-hour film?",
      "Use the symbols <, >, or = to compare: 25cm ___ a quarter of a metre.",
      "Put these capacities in descending order: 1 litre, 1200ml, 900ml, 1.5 litres.",
      "Which is heavier, 200g of feathers or 200g of stones? Use the = sign.",
      "Order these times from shortest to longest: 45 minutes, 1 hour, 25 minutes, half an hour.",
      "A rope is 2 metres long. Another rope is 180cm long. Which is longer?",
      "Use the symbols <, >, or = to compare: 750g ___ three quarters of a kilogram.",
      "A can holds 330ml. A bottle holds half a litre. Which holds more?",
      "Order these masses from lightest to heaviest: 500g, 5kg, 50g.",
      "Which is a shorter distance: 1km or 1200m?",
      "Use the symbols <, >, or = to compare: 90 minutes ___ 1.5 hours.",
      "A plant is 67cm tall. Another plant is 65cm tall. Which is shorter?",
      "A bag of flour weighs 1.5kg. A bag of sugar weighs 1500g. Compare their weights.",
      "Circle the largest volume: 2 litres, 2500ml, 2200ml.",
      "Order these children from shortest to tallest: Amy (1m 15cm), Leo (120cm), Sara (1m 5cm).",
      "Use the symbols <, >, or = to compare: 2 days ___ 48 hours.",
      "A plank is 3m long. A second plank is 305cm long. Which is shorter?",
      "A cat weighs 4kg. A puppy weighs 3500g. Which is heavier?",
      "Which holds less: a jug with 1 litre of water, or a bucket with 1500ml of water?",
      "Order these amounts of time from longest to shortest: 1 day, 25 hours, 1200 minutes.",
      "Use the symbols <, >, or = to compare: 199cm ___ 2m.",
      "A watermelon weighs 3kg. A pineapple weighs 2800g. Which is lighter?",
      "Put these volumes in order, starting with the smallest: 950ml, 1 litre, 0.9 litres.",
      "Which is longer: a 90-minute film or a film that lasts 1 hour and 20 minutes?",
      "Use the symbols <, >, or = to compare: 1500m ___ 1.5km."
    ],
    "Year 3": [
      "A pencil is 15cm long. A ruler is 30cm long. How much longer is the ruler?",
      "A bag of sugar weighs 1kg. A bag of flour weighs 750g. Which is lighter?",
      "A can of fizzy drink holds 330ml. A bottle of water holds 500ml. Which has a larger capacity?",
      "Convert 1.5kg to grams. Is this more or less than 1200g?",
      "Order these lengths from shortest to longest: 1m, 120cm, 95cm, 1m 10cm.",
      "Convert 250cm to metres. Is this longer or shorter than 2m?",
      "A pineapple weighs 1.2kg. An orange weighs 200g. Which is heavier?",
      "A swimming pool holds 5000 litres of water. A paddling pool holds 50,000ml. Which holds more?",
      "Order these masses: 1.5kg, 2000g, 1200g, 0.5kg.",
      "Use the symbols <, >, or = to compare: 35mm ___ 3cm.",
      "A running track is 400m long. A football pitch is 110m long. Which is shorter?",
      "A bag of flour is 1.5kg. A bag of sugar is 1kg 200g. Which is lighter?",
      "Compare these volumes: 1.2 litres ___ 1100ml.",
      "Arrange these lengths in descending order: 2km, 250m, 2.1km, 2050m.",
      "Is 4kg and 50g heavier or lighter than 4.5kg?",
      "Would a mug of tea be closer to 300ml or 3 litres?",
      "A piece of string is 2m 5cm long. Write this in centimetres.",
      "Order these weights from lightest to heaviest: 750g, 1.1kg, 0.9kg, 1050g.",
      "A journey is 5km long. Another journey is 500m long. Which is ten times longer?",
      "Use the symbols <, >, or = to compare: 750ml ___ 0.75 litres.",
      "A plank of wood is 3m long. A door is 195cm tall. Which is longer?",
      "Which is heavier: 3.5kg of feathers or 3kg of stones?",
      "A recipe needs 0.5 litres of milk. You have a 600ml carton. Do you have enough?",
      "Order these lengths: 10mm, 1cm, 0.1m, 1m.",
      "Is a weight of 2050g more or less than 2.5kg?",
      "A piece of ribbon is 1m 25cm long. Another is 130cm long. Which is longer?",
      "Compare the weights: 2kg 50g and 2500g.",
      "Which container has a larger capacity: a 1.5 litre bottle or a 1400ml jug?",
      "Arrange these measurements from shortest to longest: 25mm, 2cm, 0.02m.",
      "Is a mass of 990g greater or less than 1kg?",
      "A book is 23cm long. A shelf is 1m long. How many books could fit on the shelf?",
      "A parcel weighs 1.8kg. The maximum postage weight is 2kg. Is the parcel light enough?",
      "A recipe calls for 450ml of stock. You have a 0.5 litre carton. Is there enough?",
      "Order these lengths from longest to shortest: 300cm, 3.5m, 3m 20cm.",
      "Use the symbols <, >, or = to compare: 1001g ___ 1kg.",
      "Which holds more: three cans of 330ml or a 1 litre bottle?",
      "A child is 1m 10cm tall. To go on a ride, they must be 120cm tall. Are they tall enough?",
      "A bag of apples weighs 1.2kg. A bag of bananas weighs 1kg 250g. Which is heavier?",
      "A car's fuel tank holds 40 litres. A petrol can holds 5000ml. How many cans to fill the tank?",
      "Put these lengths in ascending order: 1.5km, 1600m, 1km 400m.",
      "Which is lighter: a 2.2kg bag of potatoes or a 2150g bag of potatoes?",
      "A watering can holds 5 litres. A bucket holds 8000ml. What is the difference in capacity?",
      "Compare the lengths: 99mm and 10cm.",
      "A box of cereal weighs 0.75kg. Is that more or less than 750g?",
      "Which is the larger volume: 2.5 litres or 2499ml?",
      "Order these from heaviest to lightest: 0.5kg, 50g, 5000g, 5.5kg.",
      "A bridge is 1km long. A train is 200m long. How many train lengths fit on the bridge?",
      "A bottle of medicine holds 150ml. A dose is 5ml. How many doses are in the bottle?",
      "Which length is the odd one out: 2.5m, 250cm, 2500mm, 25m?",
      "A shopping bag can hold 5kg. The shopping weighs 4800g. Will it hold?",
      "A fish tank needs 25 litres of water. You have a 2 litre jug. How many times must you fill it?"
    ],
    "Year 4": [
      "Which is a better value: 2 litres of milk for £1.50 or 500ml for 40p?",
      "An apple costs 35p. A banana costs 40p. Which is cheaper?",
      "Would you measure the distance to the next town in metres or kilometres?",
      "Compare these amounts using <, >, or =: £2.50 ___ 250p.",
      "Which is heavier, a bag of crisps (25g) or a bar of chocolate (100g)?",
      "A 1kg bag of carrots costs £1. A 750g bag of carrots costs 80p. Which is better value for money?",
      "A pack of 4 yoghurts costs £1.20. A single yoghurt costs 35p. Is it cheaper to buy four single yoghurts?",
      "Compare the distance from your school to your home, and from your school to the local shop. Which is further?",
      "Is it better to buy a 2-litre bottle of lemonade for £1.80 or two 1-litre bottles for 95p each?",
      "A monthly bus pass is £40. A single ticket is £2.50. If you make 20 journeys in a month, which is cheaper?",
      "Compare these prices using <, >, or =: £15.01 ___ 1510p.",
      "Would you measure the weight of a person in grams or kilograms?",
      "A car is 4.5m long. A parking space is 500cm long. Is the space long enough?",
      "A book costs £7.99. The same book costs 8 Euros. Given £1 is about 1.15 Euros, which is cheaper?",
      "Is a temperature of 25°C hotter or colder than 10°C?",
      "Compare the area of two classrooms. Which is larger?",
      "A box of cereal weighing 500g costs £2.00. A larger box weighing 750g costs £2.70. Which is the better buy per gram?",
      "Compare these amounts: 350p ___ £3.05.",
      "Which unit of measurement would be most appropriate to measure the capacity of a car's petrol tank?",
      "You have £10. Can you afford to buy a DVD for £7.50 and popcorn for £2.99?",
      "Which is a longer period of time: 3 weeks or 20 days?",
      "A fence is 1.8m tall. A wall is 170cm tall. Which is shorter?",
      "A job pays £10 per hour. Another job pays £75 for an 8-hour day. Which job pays more per hour?",
      "Compare the weight of your school bag in the morning and the afternoon. When is it heavier?",
      "Is it generally warmer in June or in December in the UK?",
      "A 500g jar of coffee costs £4.00. A 200g jar costs £2.00. Which is better value?",
      "Which is a greater amount: one thousand pence or ten pounds?",
      "Would you measure the length of a river in centimetres or kilometres?",
      "Compare the duration: a 1 hour 30 minute film vs a 100 minute film.",
      "A pack of 3 pens costs 99p. A single pen costs 35p. Which is cheaper per pen?",
      "Use <, >, or = to compare: 4500g ___ 4.5kg.",
      "A holiday in Spain costs €500. A holiday in Portugal costs £450. If £1 = €1.10, which holiday is cheaper?",
      "Which is the colder temperature: -5°C or -2°C?",
      "A 2 litre bottle of water costs £1.00. A 500ml bottle costs 30p. Which is better value per litre?",
      "Compare these amounts of money: £0.50 and 5p.",
      "Which is a longer distance: 2.5km or 2400m?",
      "A bag of 6 apples costs £1.20. A bag of 8 apples costs £1.68. Which is better value per apple?",
      "Use <, >, or = to compare: 90 seconds ___ 1.5 minutes.",
      "A book has a mass of 0.8kg. A laptop has a mass of 1200g. Which is heavier?",
      "Which is the better offer: 'Buy one get one free' on items costing £5, or a '3 for 2' offer on the same items?",
      "Compare the areas: a field that is 100m x 50m vs a field that is 80m x 60m.",
      "A train journey takes 2 hours 15 minutes. A car journey takes 140 minutes. Which is quicker?",
      "A 75cl bottle of juice costs £1.50. A 1 litre carton costs £1.80. Which is better value?",
      "Use <, >, or = to compare: £1,250 ___ one thousand two hundred and five pounds.",
      "Which is heavier: 1 tonne or 1001kg?",
      "A phone plan costs £10 a month for 1000 minutes. Another costs £12 for 1500 minutes. Which is cheaper per minute?",
      "Compare the lengths: 1 mile or 1.5 kilometres? (1 mile ≈ 1.6km)",
      "A 1kg tub of butter costs £5. A 250g block costs £1.30. Which is better value?",
      "Which is warmer: the average UK summer temperature (19°C) or a hot oven (200°C)?",
      "Use <, >, or = to compare: half a day ___ 10 hours."
    ]
  },
  "estimate_measure_and_read_scales": {
    "Year 1": [
      "How many building blocks long is your desk?",
      "Use a ruler to measure the length of your pencil in centimetres.",
      "Choose two objects in the classroom. Which do you estimate is heavier? Now use a balance scale to check.",
      "How many cups of water do you think it will take to fill a jug?",
      "Using a timer, how long does it take to write your name five times?",
      "How many of your hand spans does it take to measure the width of the door?",
      "Estimate how many pencils long the teacher's desk is, then check.",
      "Find an object you think is heavier than your shoe. Use a balance scale to compare them.",
      "Estimate how many small cubes will fit into a large box.",
      "Use a stopwatch. How many star jumps can you do in 30 seconds?",
      "Measure your height using a tape measure.",
      "Find an object in the classroom and record its length in centimetres.",
      "Estimate which holds more: a cup or a bucket.",
      "How many steps does it take to walk across the classroom?",
      "Measure the length of a book using paperclips.",
      "Estimate if your water bottle is full, half full, or empty.",
      "How long does it take for a sand timer to run out?",
      "Measure the weight of three different objects using a balance scale and put them in order.",
      "Estimate how many Lego bricks tall your chair is.",
      "Record the time it takes for a friend to run across the playground.",
      "Measure the width of a window in hand spans.",
      "Estimate how many glasses of water would fill a watering can.",
      "Find a leaf outside and measure its length with a ruler.",
      "Use a balance to find something that weighs the same as 10 connecting cubes.",
      "Record what time school starts and finishes by looking at the clock.",
      "How many steps long is the school corridor? Estimate first, then measure.",
      "Use non-standard units, like crayons, to measure the length of your table.",
      "Which do you estimate is heavier: a whiteboard pen or a pair of scissors? Use a balance to check.",
      "Estimate how many handfuls of sand would fill a bucket.",
      "Use a clock with a second hand to time how long you can stand on one leg.",
      "Measure the height of your friend using building blocks.",
      "Find three things in the classroom that are shorter than your ruler.",
      "Estimate which is lighter: an apple or a banana? Check with a balance scale.",
      "How many yoghurt pots of water do you think will fill a large bowl?",
      "Time how long it takes to sing 'Happy Birthday' three times.",
      "Measure your own foot using 1p coins lined up end to end.",
      "Record the length of a piece of string in centimetres.",
      "Find something in the room that you think has the same weight as your reading book.",
      "Estimate how many times you can write the number 8 in one minute.",
      "Use a ruler to measure the shortest side of a rectangular table.",
      "How many of your feet (heel to toe) is it from your desk to the door?",
      "Estimate the weight of an empty lunchbox, then weigh it with something heavy inside.",
      "Pour water from a full cup into an empty jug. Describe how full the jug is.",
      "Use a calendar to find out how many seconds there are in a minute.",
      "Measure the longest object in your pencil case.",
      "Which is heavier: a stack of 5 books or a single chair?",
      "Estimate how many little cups of rice would fill a big cup.",
      "How long does the school lunchtime last? Record the start and end times.",
      "Measure the distance around a hula hoop using a piece of string."
    ],
    "Year 2": [
      "What unit would you use to measure the length of the classroom? (cm or m)",
      "Read the weighing scale. How much does the bag of flour weigh in grams?",
      "The thermometer shows the temperature in the classroom. What is the temperature in degrees Celsius?",
      "How much water is in the measuring jug in millilitres?",
      "Estimate the height of your chair in centimetres, then measure it with a ruler.",
      "Estimate the weight of your reading book in grams, then use a scale to measure it.",
      "What is the temperature on the thermometer outside? Is it hot or cold?",
      "Measure the height of your friend in metres and centimetres.",
      "Read the scale on the measuring jug. How much juice is there in millilitres?",
      "Estimate the mass of an apple. Is it closer to 10g, 100g or 1kg?",
      "Use a ruler to draw a line that is exactly 12cm long.",
      "Read the weight on a kitchen scale. How many kilograms does the bag of sugar weigh?",
      "The weather forecast says it will be 15°C. What sort of clothes should you wear?",
      "Pour 200ml of water into a measuring jug.",
      "Estimate the length of the school hall in metres.",
      "Measure the perimeter of your table using a tape measure.",
      "What weight is the arrow pointing to on this scale? (Image of a scale needed).",
      "Look at the thermometer in the classroom. Record the temperature.",
      "How much liquid is in this beaker? (Image of a beaker with a scale needed).",
      "Estimate the capacity of your water bottle. Is it more or less than 1 litre?",
      "Measure the length and width of a piece of A4 paper in centimetres.",
      "Use a weighing scale to find out how many grams a pack of crisps weighs.",
      "What temperature does water freeze at?",
      "A recipe says to add 500ml of milk. Use a measuring jug to measure this amount.",
      "Estimate, then measure, the distance from your desk to the classroom door in metres.",
      "Choose the best unit to measure the weight of a pencil: grams or kilograms?",
      "Read the temperature from a weather app or thermometer for today. Is it hot, warm, or cold?",
      "A recipe requires 250ml of water. Shade the measuring jug to show this amount.",
      "Estimate the length of a car in metres. Then, if possible, find out the actual length.",
      "What would you use to measure the amount of water in a bath: millilitres or litres?",
      "Draw a line you estimate to be 15cm long. Check its length with a ruler.",
      "The scale shows 1.5kg. How many grams is this?",
      "The temperature in the desert can be 40°C. Is this hot or cold?",
      "How many 100ml glasses can you fill from a 1 litre bottle?",
      "Estimate the width of the school gate in metres.",
      "What standard unit would you use to measure your own height?",
      "Read the scale on a bag of potatoes. What is the mass in kg?",
      "A thermometer reads 22°C. Is this a likely temperature for an oven or a room?",
      "A measuring cylinder contains 75ml of liquid. Draw the line on a diagram.",
      "Estimate the mass of a pineapple in kilograms.",
      "Use a ruler to measure the height of a water bottle in centimetres.",
      "What does the 'g' stand for on a weighing scale?",
      "If the temperature is 0°C, what might you see outside?",
      "Estimate the capacity of a school milk carton in millilitres.",
      "Measure the length of your shoe in centimetres.",
      "Would a feather weigh more or less than 1 gram?",
      "Read the temperature on an oven dial. Is it measured in °C or ml?",
      "A jug has markings every 100ml. If the water level is on the third mark, how much water is there?",
      "Estimate the height of a door in metres.",
      "Choose the most sensible weight for a banana: 150g, 1.5kg, or 15g."
    ],
    "Year 3": [
      "Measure the length of the whiteboard in metres and centimetres.",
      "Find an object that weighs approximately 1kg. Use a digital scale to check your accuracy.",
      "How much water is in the measuring cylinder? Read the scale to the nearest millilitre.",
      "Draw a line that you estimate to be 8.5cm long. Measure it for accuracy.",
      "Read the weight shown on these bathroom scales in kilograms.",
      "Measure the perimeter of a regular pentagon with 5cm sides.",
      "A bag of flour weighs 1.5kg. What does the scale show in grams?",
      "Estimate the capacity of a large bucket. Is it closer to 1 litre, 10 litres, or 100 litres?",
      "Measure the thickness of a £1 coin in millimetres.",
      "Weigh a single grape. What is its mass in grams?",
      "Look at the markings on a ruler. How many millimetres are between the 2cm and 3cm mark?",
      "Use a tape measure to find the circumference of your head.",
      "Read the volume of liquid in a graduated cylinder, paying attention to the meniscus.",
      "Estimate the mass of a large dictionary.",
      "Measure the length of a football pitch in metres.",
      "A bottle of medicine says to take 5ml. Use a medicine spoon to measure this dose.",
      "Look at a set of kitchen scales. What is the interval between each marking?",
      "Draw a plan of your bedroom and measure its length and width.",
      "Find the total weight of 5 apples.",
      "Estimate, then measure, the volume of a lunchbox by filling it with water and pouring it into a measuring jug.",
      "Measure the length of your desk to the nearest millimetre.",
      "Estimate the mass of a bag of sugar in kg. Then read the actual mass.",
      "A measuring jug has 1 litre of water. 250ml is poured out. What does the scale read now?",
      "Draw a rectangle with a perimeter of 20cm. Measure the sides.",
      "Read the scale. The arrow is halfway between 1kg and 2kg. What is the weight?",
      "Measure the height of a classroom door in metres and centimetres.",
      "Find an object that you estimate weighs about 200g. Check your estimate.",
      "A beaker contains 450ml of liquid. If you add 100ml more, what will the new reading be?",
      "Estimate the length of your pencil in mm, then measure it.",
      "Use kitchen scales to measure out 375g of flour.",
      "Measure the perimeter of a square with sides of 7cm.",
      "Read the volume of milk in a 2-litre carton that is half full.",
      "Estimate the width of a window in centimetres.",
      "What is the mass of 1 litre of water? (Answer: 1kg).",
      "Measure the length of your arm from your elbow to your wrist in cm and mm.",
      "A scale shows 2kg and 300g. What is the total mass in grams?",
      "Estimate the capacity of a car's windscreen washer tank in litres.",
      "Draw a line that is exactly 125mm long using a ruler.",
      "Weigh a banana. Then weigh the peel. What is the mass of the part you eat?",
      "Measure the perimeter of an A4 sheet of paper.",
      "A recipe requires 750ml of stock. How would you measure this using a 500ml jug?",
      "Estimate the length of a whale in metres.",
      "Read a person's weight on a set of bathroom scales that shows 65.5kg.",
      "Measure the amount of water a sponge can soak up.",
      "What is the length of a standard 30cm ruler in millimetres?",
      "Estimate the weight of a can of baked beans.",
      "A rain gauge collected 12mm of rain. Show this on a diagram of a ruler.",
      "Measure the perimeter of a hexagon where each side is 4cm long.",
      "A measuring cylinder holds 100ml. What do the intervals of 10ml represent?",
      "Estimate the total mass of the books in your school bag."
    ],
    "Year 4": [
      "Estimate the total cost of a loaf of bread (£1.25), a pint of milk (60p) and a block of cheese (£2.50).",
      "A recipe needs 250g of flour. If you only have a 1kg bag, about what fraction of the bag will you use?",
      "If a journey starts at 2:15 pm and finishes at 3:00 pm, estimate how long it took.",
      "Estimate the length of your classroom. Would you measure it in metres or centimetres?",
      "Look at a map of your local area. Estimate the distance from your school to the nearest park.",
      "Estimate the total value of these coins in a picture: £1, 50p, 20p, 20p, 5p, 2p.",
      "A journey takes 40 minutes. If you leave at 8:30 am, estimate the arrival time.",
      "Estimate the weight of a bag of shopping. Would it be closer to 500g, 5kg, or 50kg?",
      "Look at the price of petrol per litre at a petrol station. Estimate the cost to fill a 40-litre tank.",
      "Estimate the area of your classroom floor in square metres.",
      "A menu has prices like £8.95, £12.50, and £4.99. Estimate the cost of a three-course meal.",
      "Estimate the height of a double-decker bus.",
      "If your pocket money is £5 a week, estimate how many weeks it would take to save for a £22 video game.",
      "Look at your electricity meter. Read the number shown.",
      "Estimate the amount of water you drink in a day in litres.",
      "Estimate the cost of posting a parcel based on its weight.",
      "A recipe needs 175g of sugar. Look at a bag of sugar and estimate how much this is.",
      "How long do you estimate it will take to run 100 metres?",
      "Estimate the total length of all the pencils in your pencil case.",
      "Look at a timetable for a TV channel. Estimate the total time spent on news programmes in one evening.",
      "Estimate the price of a weekly food shop for a family.",
      "How much time do you estimate you spend on homework each week?",
      "Estimate the weight of your school chair.",
      "A car's fuel gauge is halfway between full and empty. The tank holds 60 litres. Estimate how many litres are left.",
      "Estimate the temperature in the room right now.",
      "Estimate the total cost of a cinema ticket (£8.50), popcorn (£4.95), and a drink (£2.75).",
      "A jug holds 1 litre of water. You pour out what you think is 300ml. How can you check how accurate your estimate was?",
      "Estimate the perimeter of the school playground in metres.",
      "You have a £20 note. Estimate if you have enough to buy three items costing £5.99 each.",
      "Estimate the mass of a dog in kilograms.",
      "Read the departure board at a train station. If a train is due at 14:05 and it's now 13:50, about how long is the wait?",
      "Estimate the capacity of a bathtub in litres.",
      "A bill for a meal comes to £48.60. Estimate a 10% tip.",
      "Estimate the length of a football pitch. Is it closer to 10m, 100m, or 1km?",
      "Look at the prices in a supermarket catalogue. Estimate the cost of the ingredients for a simple meal.",
      "Estimate the weight of your desk in kilograms.",
      "A scale shows a parcel's weight is halfway between 2.5kg and 3kg. What is the estimated weight?",
      "Estimate how many millilitres of water are in a half-full 2-litre bottle.",
      "You need 2kg of apples. One apple weighs about 150g. Estimate how many apples you need.",
      "Estimate the total value of the coins in your teacher's purse or wallet (with permission!).",
      "Read a utility bill (gas, electric). What is the meter reading?",
      "Estimate the amount of liquid in a can of fizzy drink in ml.",
      "A recipe needs 1.2kg of meat for 6 people. Estimate how much meat would be needed for 3 people.",
      "Estimate the cost of a family holiday from a brochure.",
      "If a film is 135 minutes long, estimate its running time in hours and minutes.",
      "Estimate the mass of a car in tonnes.",
      "Read a nutrition label on a food packet. How many grams of sugar are there per 100g?",
      "Estimate the perimeter of a local park by walking around it and counting your steps.",
      "You have £5.00. Estimate the total cost of a sandwich (£2.80), crisps (85p), and a drink (£1.20).",
      "Estimate the temperature of a hot cup of tea."
    ]
  },
  "money": {
    "Year 1": [
      "What is the value of a 10p coin?",
      "Which is worth more, a 2p coin or a 5p coin?",
      "Can you name all the UK coins?",
      "If you have a 1p, 2p, and 5p coin, how much money do you have altogether?",
      "I have a coin that is silver and has seven sides. What coin is it?",
      "How many 1p coins do you need to make 5p?",
      "Can you find a coin that is brown? What is its value?",
      "I have two 10p coins. How much money do I have?",
      "Which note has the lowest value? (£5, £10, £20).",
      "Is a 50p coin worth more or less than a £1 coin?",
      "If I have three 2p coins, how much do I have?",
      "Name a coin that is gold and silver.",
      "What is the colour of a £10 note?",
      "How many 5p coins are worth the same as a 20p coin?",
      "I have a £2 coin and a £1 coin. How much money do I have?",
      "Find two coins that add up to 3p.",
      "What coin has 12 sides?",
      "How many 1p coins are in a £1 coin?",
      "If I have a 20p coin and a 5p coin, do I have more or less than 22p?",
      "Can you show me 8p using exactly three coins?",
      "Name all the silver coins.",
      "What is the value of a £20 note?",
      "If I have two 50p coins, how much money do I have?",
      "Find three coins that add up to 16p.",
      "Which is worth more: four 1p coins or one 5p coin?",
      "What coin is small, silver and round?",
      "How many 1p coins make 10p?",
      "If you have a 5p coin and a 2p coin, how much do you have?",
      "Which is worth less: a £5 note or a £10 note?",
      "Can you find two coins that have the same value?",
      "What is the biggest coin in size?",
      "I have a 10p coin and a 5p coin. How much money is that?",
      "Name a bank note that is orange.",
      "How many 2p coins make 10p?",
      "What is the total value of a 50p coin and a 10p coin?",
      "Find a coin that is worth 100 pennies.",
      "If I have four 1p coins, how much do I have?",
      "Which is worth more: a 50p coin or three 10p coins?",
      "What is the value of the coin with two colours?",
      "How many 5p coins make 15p?",
      "I have a 20p coin and a 2p coin. How much is that?",
      "Which coin is worth the most?",
      "Which bank note is worth the least?",
      "If I have a £1 coin and a 10p coin, do I have more than 105p?",
      "Show me 6p using the smallest number of coins.",
      "How much is a 1p, a 2p and another 1p coin altogether?",
      "What is the shape of a 20p coin?",
      "How many 10p coins are equal to a 50p coin?",
      "Can you add a 50p coin and a £1 coin?",
      "Which is worth less: a 2p coin or a 1p coin?"
    ],
    "Year 2": [
      "How many 10p coins make £1?",
      "If you buy a comic for 60p and pay with a £1 coin, how much change will you get?",
      "Sophie buys a cake for 35p and a drink for 25p. How much does she spend altogether?",
      "Write down two different ways to make 20p using coins.",
      "What do the symbols £ and p stand for?",
      "A pen costs 45p. Which coins could you use to pay for it exactly?",
      "You have £1 and spend 70p. How much change do you get?",
      "How much is two £5 notes and three £1 coins?",
      "Find the total of £2, 50p, and 5p.",
      "Show three ways to make 50p.",
      "If you save 10p every day for a week, how much will you have?",
      "An ice cream costs 85p. You pay with a £1 coin. What is your change?",
      "Which costs more, a comic for £1.50 or a book for £1.25?",
      "How many 20p coins do you need to make £2?",
      "Sarah has £5. She buys a magazine for £2.50. How much is left?",
      "Add these amounts: £3 and 40p + £1 and 20p.",
      "What is the difference between £10 and £6.50?",
      "A bus ticket is 90p. How much for two tickets?",
      "Can you buy a toy for £3.75 if you have a £5 note?",
      "I have three 50p coins and two 20p coins. How much money is that?",
      "How much more do I need to make £1 if I have 65p?",
      "A rubber costs 15p. A ruler costs 25p. How much for both?",
      "Find the value of one £10 note, one £5 note, and three £2 coins.",
      "If I share £2 equally between two people, how much do they get each?",
      "I buy a drink for 65p and crisps for 55p. How much have I spent?",
      "Tom has a 50p coin and three 10p coins. How much money does he have?",
      "A banana costs 30p. An apple costs 25p. How much for one of each?",
      "How can you make 75p using exactly three coins?",
      "I have £1 and buy a chocolate bar for 55p. What change will I receive?",
      "How many 5p coins are in 50p?",
      "Lily has two 20p coins and one 5p coin. Does she have enough to buy a comic for 40p?",
      "Find the total of a £1 coin, a 50p coin, and a 5p coin.",
      "Show £1.50 using the smallest number of coins.",
      "If I have three 20p coins, how much more do I need to make £1?",
      "A toy car costs £1.20. A toy boat costs £1.50. What is the difference in price?",
      "How many £2 coins are there in £10?",
      "Sam wants to buy a book for £5. He has saved £3.50. How much more does he need?",
      "Add together 45p and 35p.",
      "Can you make 37p using UK coins?",
      "I pay for a 70p item with a £2 coin. How much change do I get?",
      "What is the total of a £5 note and a £10 note?",
      "A pack of stickers costs 80p. How much would 2 packs cost?",
      "How would you write one pound and five pence using the £ symbol?",
      "If I have two 50p coins and I spend 80p, how much do I have left?",
      "Find three coins that total 26p.",
      "How many 50p coins make £3.00?",
      "Which is more money: four 20p coins or three 50p coins?",
      "A cup of juice is 40p. A biscuit is 15p. How much for both?",
      "What is double £1.25?",
      "Show how to make £2.35 using four coins."
    ],
    "Year 3": [
      "A computer game costs £15. You have saved £8.50. How much more do you need?",
      "Calculate the change from £10 for items costing £3.40 and £2.80.",
      "Three friends share the cost of a pizza that is £9.60. How much do they each pay?",
      "A cinema ticket costs £4.75. How much would it cost for a family of four?",
      "Find the total cost of a book at £6.99 and a pen at £1.25.",
      "How much is five £2 coins, three 50p coins, and seven 5p coins?",
      "I bought two items for £5.60. One cost £2.90. What did the other one cost?",
      "A weekly bus pass costs £12.50. How much would four weeks cost?",
      "A sandwich costs £2.80, a drink 95p, and a cake £1.50. What is the total?",
      "If I have a £20 note, can I buy three books that cost £6 each? What change will I get?",
      "Find half of £7.50.",
      "I have a mixture of 8 coins in my pocket worth 97p. What could they be?",
      "What is the difference in price between a £12.99 toy and a £17.50 toy?",
      "A school trip costs £14 per child. How much for 10 children?",
      "Find 1/4 of £20.",
      "I bought 5 pens for 40p each. How much did I spend in total?",
      "A meal costs £23.70. How much change is there from a £50 note?",
      "If I save £3 a week, how long will it take to save for a bike that costs £36?",
      "A DVD costs £8.99. A Blu-ray costs £11.49. How much more is the Blu-ray?",
      "Add up these amounts: £10.60, £5.80 and £3.20.",
      "A t-shirt costs £5.50 and a pair of shorts costs £4.75. How much do they cost altogether?",
      "A pack of pens costs £2.40. There are 6 pens in the pack. What is the cost per pen?",
      "A café sells coffee for £2.60 and tea for £1.90. How much more does the coffee cost?",
      "If I pay for a £2.80 magazine with a £5 note, how much change will I get?",
      "I buy a book for £4.80 and pay with a £10 note. What is my change?",
      "A football costs £8.25. A pump costs £3.99. What is the total cost?",
      "How much change would you get from a £10 note if you spent £6.35?",
      "If 4 children share £10 equally, how much does each child get?",
      "A swimming lesson costs £6.50. How much would 5 lessons cost?",
      "Find the sum of £12.45 and £7.80.",
      "I have £15. I buy a DVD for £8.99. How much money is left?",
      "A train ticket costs £22.50. How much would it cost for 3 people?",
      "Convert 350p into pounds and pence.",
      "A family meal costs £34.60. They pay with two £20 notes. What is their change?",
      "What is £10 minus £4.72?",
      "If I save £1.50 each week, how much will I save in 6 weeks?",
      "A jacket costs £25. It is in a sale with £5.50 off. What is the new price?",
      "Find the cost of 10 stamps if one stamp costs 65p.",
      "Add £3.45, £2.99 and £1.50 together.",
      "A book costs £7.49. How much change from £20?",
      "If a pack of 8 batteries costs £4.80, what does one battery cost?",
      "Subtract £2.80 from £5.00.",
      "A monthly magazine subscription is £4.25. What is the cost for a whole year?",
      "What is one third of £9.30?",
      "A comic is £1.25 and a magazine is £2.10. How much more is the magazine?",
      "How many 50p coins do you need to make £5.50?",
      "If you spend £1.75 and £2.50, what is the total spend?",
      "A toy car costs £3.75. How much would 3 cost?",
      "What is the difference between £20 and £11.65?",
      "If I have £8.40 and I divide it among 4 people, how much does each get?"
    ]
  },
  "telling_time_ordering_time_duration_and_units_of_time": {
    "Year 1": [
      "What time is it if the big hand is on the 12 and the little hand is on the 3?",
      "Draw the hands on a clock to show half past 4.",
      "What day comes after Tuesday?",
      "Put these in order: morning, afternoon, evening.",
      "Which month is your birthday in?",
      "Draw a clock showing 9 o'clock.",
      "If it is morning now, what part of the day comes next?",
      "Which season comes after summer?",
      "What day is it today? What day will it be tomorrow?",
      "Point to the hour hand on a clock. Point to the minute hand.",
      "Is playtime in the morning or the afternoon?",
      "How many days are in a week?",
      "The clock says 1 o'clock. What time will it be in one hour?",
      "What month comes before January?",
      "Show me half past 2 on a clock.",
      "Which day of the week is the first day of the school week?",
      "Name the four seasons.",
      "If a party starts at 3 o'clock and lasts for one hour, what time does it finish?",
      "What do you usually do in the evening?",
      "What is special about Saturday and Sunday?",
      "Draw a clock that shows the time you go to bed.",
      "Put these in order: breakfast, lunch, dinner.",
      "How many months are in a year?",
      "What time does school finish?",
      "If the time is half past 8, where is the big hand pointing?",
      "What time is it one hour after 7 o'clock?",
      "Show half past 11 on a clock face.",
      "What is the day before Saturday?",
      "Put these events in order: go to school, wake up, go to bed, eat dinner.",
      "Name a month in the season of winter.",
      "The little hand is pointing at the 6, the big hand is pointing at the 12. What time is it?",
      "If it is half past 9, where is the minute hand?",
      "What day of the week is your favourite?",
      "Which comes first, March or May?",
      "Draw a clock showing the time you have lunch.",
      "What time is it one hour before 2 o'clock?",
      "How many days are there from Monday to Friday?",
      "A TV show starts at 5 o'clock. Where are the hands on the clock?",
      "What is the last month of the year?",
      "Show half past six on a clock.",
      "Put these in order of a day: sunrise, sunset, midnight, noon.",
      "Which season has Christmas in it?",
      "If you go to the park at 4 o'clock, what will you do before that?",
      "What time is it when both hands point to the 12?",
      "Name the month that comes after August.",
      "Draw the hands on a clock to show half past one.",
      "What day is two days after Wednesday?",
      "Which takes longer: a school day or a weekend?",
      "If you wake up at 7 o'clock, is that in the morning or evening?",
      "Show 10 o'clock on a clock face."
    ],
    "Year 2": [
      "What time is quarter past 7? Show this on a clock face.",
      "A TV show starts at 5:00 and ends at 5:30. How long is the show?",
      "How many minutes are in an hour?",
      "If it is 10 o'clock now, what time will it be in 2 hours?",
      "A bus journey takes 45 minutes. If it starts at 9:00 am, what time does it finish?",
      "A programme starts at quarter to 4. What time is this in digital format?",
      "How many hours are there in a day?",
      "It is 6:15. What time will it be in 30 minutes?",
      "A school lesson is 50 minutes long. Does it last for more or less than an hour?",
      "Write the time 'twenty past three' in digital form.",
      "A bus leaves at 10:00 am and the journey is one hour long. What time does it arrive?",
      "How many seconds are in a minute?",
      "Draw the hands on a clock to show 7:25.",
      "A film starts at 3:00 pm and finishes at 4:15 pm. How long was the film?",
      "If it's half past 2 now, what time was it half an hour ago?",
      "How many full weeks are in a month?",
      "It takes 10 minutes to walk to school. If you leave at 8:20 am, what time do you arrive?",
      "What time is shown on the clock? (Image showing ten to five).",
      "Order these times from earliest to latest: 3:00 pm, 10:00 am, 5:00 pm, 12:00 pm (noon).",
      "How many hours are there in two days?",
      "What time is 15 minutes after 1:30?",
      "A cake needs to bake for 25 minutes. It goes in the oven at 11:10. When is it ready?",
      "Write 'five to nine' in two different ways.",
      "A football match is 90 minutes long. It starts at 1:00 pm. What time does it finish?",
      "How many times does the minute hand go all the way around the clock in one hour?",
      "What time is it 20 minutes before 3 o'clock?",
      "A swimming lesson is 40 minutes long. It ends at 11:00 am. What time did it start?",
      "How many minutes pass between 2:10 and 2:35?",
      "Draw the hands on a clock to show quarter to eight.",
      "A train journey takes half an hour. If it leaves at 1:15 pm, when does it arrive?",
      "How many hours are there from 9am to 2pm?",
      "A party starts at 2:00 pm and lasts for 2 hours. What time does it finish?",
      "Write the time 'ten past six' using numbers.",
      "It is now quarter past 4. What time will it be in 20 minutes?",
      "A bike ride took 55 minutes. Is that more or less than one hour?",
      "How many days are in a fortnight?",
      "A cake takes 30 minutes to cool down. It comes out of the oven at 12:00. When is it cool?",
      "Which is longer: 3 days or 70 hours?",
      "Show 5:50 on an analogue clock face.",
      "A lesson begins at 9:05 and ends at 9:55. How many minutes long is it?",
      "How many minutes are in a quarter of an hour?",
      "Lunchtime starts at 12:15 and ends at 1:00. How long is lunchtime?",
      "What time is it 25 minutes after 10:30 am?",
      "If today is the 10th of the month, what will the date be in one week?",
      "A film is 75 minutes long. How many hours and minutes is this?",
      "How many times does the hour hand go all the way around the clock in one day?",
      "A park opens at 9am and closes at 6pm. For how many hours is it open?",
      "Write 'twenty-five to seven' in digital format.",
      "It takes 5 minutes to boil a kettle. If I start at 8:50 am, what time will it be ready?"
    ],
    "Year 3": [
      "Write 4:45 pm in 24-hour clock format.",
      "How many days are there in March?",
      "A film is 90 minutes long. How many hours and minutes is this?",
      "If you go to bed at 8:30 pm and wake up at 7:00 am, how long have you slept for?",
      "Look at a calendar. What day of the week is the 15th of the current month?",
      "A train is due at 16:10. It is 15 minutes late. What time does it arrive?",
      "How many days are there in a leap year?",
      "What time is it 25 minutes after 7:50 am?",
      "A TV show lasts for 45 minutes and ends at 6:00 pm. What time did it start?",
      "Write quarter to three in the afternoon in 24-hour format.",
      "How many hours and minutes is 100 minutes?",
      "A car journey took 2 hours and 30 minutes. If the family arrived at 1:00 pm, what time did they set off?",
      "Which months have exactly 30 days?",
      "Show 19:30 on an analogue clock face.",
      "A boy goes on holiday for 3 weeks. How many days is he away?",
      "What is the time 12 hours after 3:00 am?",
      "I leave home at 8:15 am and arrive at school at 8:40 am. How long is my journey?",
      "How many seconds are in five minutes?",
      "It is 2:00 pm. You are going to a party at 4:30 pm. How long do you have to wait?",
      "A clock shows Roman numerals. What time is it if the hour hand points to VI and the minute hand points to XII?",
      "A flight from London to Rome takes 2 hours and 20 minutes. If it departs at 11:00, when does it land?",
      "How many days are there altogether in July and August?",
      "What is the date one week after the 25th of December?",
      "A swimming lesson starts at 9:05 am and finishes at 9:55 am. How long is the lesson?",
      "Convert 3 days into hours.",
      "A bus leaves at 13:45. The journey takes 50 minutes. What time does it arrive?",
      "How many seconds are there in 2.5 minutes?",
      "A film starts at 18:00 and is 110 minutes long. What time does it finish?",
      "What is the date 2 weeks before the 30th of April?",
      "Write 8:20 in the morning using a.m. or p.m.",
      "How many days are there in this year?",
      "A train journey begins at 10:25 and ends at 11:10. How long did it take?",
      "How many minutes are there from 9:50 am to 10:15 am?",
      "Write half past seven in the evening in 24-hour clock time.",
      "What time is it 3 hours and 15 minutes after 14:00?",
      "How many months are there from the start of May to the end of August?",
      "A cake takes 35 minutes to bake. It goes in the oven at 4:30 pm. When is it ready?",
      "How many hours are there in a week?",
      "A clock's minute hand is on the IX and the hour hand is just before the V. What time is it?",
      "A school sports day starts at 9:30 am and finishes at 2:15 pm. How long does it last?",
      "How many days are in February in a leap year?",
      "What time is 45 minutes before 12:30 pm?",
      "Convert 150 minutes into hours and minutes.",
      "A boy's birthday is in October. His sister's is 3 months later. What month is her birthday?",
      "Write 00:30 in 12-hour clock format, using a.m. or p.m.",
      "A car is parked from Monday 9:00 am to Tuesday 9:00 am. How many hours is that?",
      "How many seconds are in one hour?",
      "A play is 2 hours and 5 minutes long. How many minutes is that?",
      "If the time is 20:50, how many minutes is it until 9 pm?",
      "What is the time shown by the Roman numerals XI on a clock face?"
    ],
    "Year 4": [
      "A train leaves at 14:20 and arrives at 15:05. How long is the journey?",
      "How many seconds are in 3 minutes?",
      "Convert 2 and a half hours into minutes.",
      "How many weeks are in a year?",
      "Change 150 minutes into hours and minutes.",
      "A film starts at 18:30 and is 1 hour 45 minutes long. What time does it finish?",
      "How many days are in 5 years, assuming one is a leap year?",
      "Change 200 seconds into minutes and seconds.",
      "Write 2:35 am in 24-hour clock time.",
      "A school day starts at 8:50 am and finishes at 3:20 pm. How long is the school day?",
      "How many months are in 3 and a half years?",
      "Convert 5 hours and 20 minutes into minutes only.",
      "What is 72 hours in days?",
      "A family sets off on a journey at 09:00. They stop for a 45-minute break and arrive at their destination at 13:15. How long were they driving for?",
      "Write quarter past five in the evening on a 24-hour digital clock.",
      "How many weeks are there in 6 months?",
      "A train was scheduled to arrive at 11:45 but arrived at 12:10. How many minutes late was it?",
      "Convert 3.5 minutes to seconds.",
      "A worker's shift is from 22:00 to 06:00. How long is the shift?",
      "If your birthday is on the 5th of April, how many days is it until the 1st of May?",
      "Change 48 months into years.",
      "A student spends 1 hour on English homework and 40 minutes on maths. How long is this in total?",
      "Read the time on an analogue clock and write it in 12-hour and 24-hour digital format.",
      "How many hours and minutes are there from 10:30 am to 1:15 pm?",
      "A tap drips once every 30 seconds. How many times will it drip in 5 minutes?",
      "Convert 5 days into hours.",
      "A TV series has 6 episodes, each 45 minutes long. What is the total running time?",
      "How many seconds are in 1 hour and 10 minutes?",
      "Write 11:15 pm in 24-hour format.",
      "A flight departs at 10:00 and lands at 14:30. How long is the flight?",
      "How many complete weeks are there in 50 days?",
      "A recipe says to simmer a sauce for 1.5 hours. How many minutes is that?",
      "A bus arrives every 20 minutes. If one arrives at 9:10 am, what time is the next one?",
      "How many years and months is 30 months?",
      "A car journey takes 3 hours and 25 minutes. If it ends at 16:00, when did it start?",
      "Write midnight in 24-hour clock format.",
      "How many minutes are in 4.5 hours?",
      "A school has 6 lessons a day, each 50 minutes long. How long is spent in lessons in hours and minutes?",
      "Convert 42 days into weeks.",
      "A train journey takes 2 hours 50 minutes. How many minutes is this?",
      "What is the time 8 hours after 17:00?",
      "How many seconds are in a quarter of an hour?",
      "Convert 2 years and 3 months into months.",
      "A meeting starts at 11:30 and lasts for 90 minutes. What time does it finish?",
      "How many days are there from the 3rd of June to the 1st of July?",
      "Write 1 minute 45 seconds purely in seconds.",
      "It takes 25 minutes to get to the cinema. The film starts at 17:00. What is the latest you can leave?",
      "How many hours are in 360 minutes?",
      "A worker starts at 07:30 and finishes at 15:30. They have a 45 minute break. How long do they work for?",
      "Convert 10 weeks into days."
    ],
    "Year 5": [
      "A flight takes off at 09:40 and lands at 13:25. How long is the flight in hours and minutes?",
      "If a recipe says to bake a cake for 55 minutes and it goes in the oven at 11:30 am, what time should it come out?",
      "How many days are in 3 years, including one leap year?",
      "A car race lasts for 3 hours and 45 minutes. The race starts at 1:15 pm. What time does it finish?",
      "Convert 2.5 days into hours.",
      "A concert starts at 7:45 pm and lasts for 2 hours and 20 minutes. What time does it end?",
      "A runner completed a race in 150 minutes. How many hours and minutes is that?",
      "How many seconds are in half an hour?",
      "A bus runs every 12 minutes. If the first bus is at 6:30 am, what time is the fourth bus?",
      "A plane journey takes 6.5 hours. If it lands at 14:00, what time did it take off?",
      "How many hours are in a fortnight?",
      "A project is due in 3 weeks. You estimate it will take 30 hours to complete. How many hours a day do you need to work on it if you work 5 days a week?",
      "Convert 1.25 hours into minutes.",
      "The time is 15:50. How long is it until 7 pm?",
      "A train journey from Manchester to London takes 2 hours and 10 minutes. If you need to be in London by 11:30 am, what is the latest train you can catch?",
      "How many minutes are there in a day?",
      "A satellite orbits the Earth every 90 minutes. How many orbits does it complete in 24 hours?",
      "Convert 10,000 seconds into hours, minutes, and seconds.",
      "A meeting is scheduled for 10:00 am and lasts 75 minutes. There is then a 20-minute break before the next meeting. What time does the second meeting start?",
      "Your friend in New York is 5 hours behind you. If it is 6 pm in London, what time is it in New York?",
      "How many days old will you be on your 10th birthday (don't forget leap years!)?",
      "A car is parked from 9:30 am on Monday to 1:00 pm on Tuesday. How many hours has it been parked?",
      "The school holidays are 6 weeks long. How many hours is this?",
      "A recipe requires a dough to rise for 45 minutes, be kneaded for 10, and then rise again for 1 hour 15 minutes. What is the total time required?",
      "If a movie is 135 minutes long, what is its running time in hours and minutes?",
      "How many hours and minutes are there in 200 minutes?",
      "A train leaves at 08:55 and arrives at 11:40. How long did the journey take?",
      "Convert 3.5 weeks into days.",
      "A worker's shift is 8.5 hours long. How many minutes is this?",
      "What is the time 50 minutes before 1:20 pm?",
      "How many decades are in 250 years?",
      "A car is driven for 45 minutes every day. How many hours is this in a week?",
      "Convert 1000 hours into days and hours.",
      "A ferry sails at 23:15 and docks at 06:50 the next day. How long is the crossing?",
      "How many seconds are there in 1.75 minutes?",
      "A TV series has a total running time of 8 hours. If each episode is 40 minutes long, how many episodes are there?",
      "What is the time in Tokyo if it is 8 hours ahead of London and the time in London is 15:00?",
      "Convert 500 days into years, weeks, and days (assume a non-leap year).",
      "A battery lasts for 36 hours. How many days is this?",
      "How many minutes are there from 10:40 am on Tuesday to 1:10 pm on Tuesday?",
      "A historical period lasted for 150 years. How many decades is that?",
      "Convert 450 seconds into minutes and seconds.",
      "The summer holidays last for 44 days. How many weeks and days is this?",
      "A plane is delayed by 2 hours and 35 minutes. Its original departure time was 19:50. What is the new departure time?",
      "How many minutes are in 0.25 of an hour?",
      "A project takes 100 hours to complete. If a team of 4 people work on it, and each works for 5 hours a day, how many days will it take?",
      "Convert 3600 seconds into hours.",
      "A train was due at 16:30. It arrived 75 minutes late. What time did it arrive in 24-hour format?",
      "How many centuries are in a millennium?",
      "A person sleeps for 8 hours a night. How many hours do they sleep in a year?"
    ]
  },
  "convert_between_metric_units": {
    "Year 5": [
      "How many metres are in 3.5 kilometres?",
      "Convert 2500 grams into kilograms.",
      "A bottle contains 1.5 litres of water. How many millilitres is this?",
      "Change 45mm into centimetres.",
      "A piece of wood is 2.2 metres long. What is its length in centimetres?",
      "How many grams are in 4.5 kilograms?",
      "A ribbon is 1.8 metres long. How many centimetres is this?",
      "Convert 75mm into centimetres.",
      "A bucket holds 3.2 litres. What is its capacity in millilitres?",
      "A marathon is approximately 42 kilometres long. How many metres is this?",
      "Change 560cm into metres.",
      "A recipe uses 250g of butter. How many kilograms is this?",
      "A bottle of shampoo holds 0.4 litres. How many millilitres is this?",
      "A tower is 0.15km high. What is its height in metres?",
      "A small insect is 0.8cm long. How long is it in millimetres?",
      "Convert 1250ml to litres.",
      "An athlete runs 5000m. How many kilometres has he run?",
      "A bag of sweets weighs 0.125kg. What is the weight in grams?",
      "A fence panel is 180cm wide. What is its width in metres?",
      "A medicine dose is 5ml. A bottle contains 0.1 litres. How many doses are in the bottle?",
      "A room is 4.2m long. What is this measurement in centimetres?",
      "Change 3400g to kilograms.",
      "A journey is 3200m. How far is this in kilometres?",
      "Convert 2.75 litres into millilitres.",
      "A stack of paper is 4.5cm thick. What is the thickness in millimetres?",
      "A car travels 8km. How many metres is this?",
      "A bag of flour weighs 1.2kg. How many grams is this?",
      "A jug contains 750ml of juice. What is this in litres?",
      "Convert 1.5cm into millimetres.",
      "How many metres are in 250cm?",
      "A box weighs 3500g. What is its mass in kilograms?",
      "How many millilitres are in a 2-litre bottle of pop?",
      "A pencil is 15cm long. What is its length in millimetres?",
      "How many kilometres is 4500m?",
      "A recipe calls for 0.5kg of sugar. How many grams do you need?",
      "A swimming pool contains 50,000 litres of water. How many kilolitres is this?",
      "A piece of wire is 2.05m long. Write this length in centimetres.",
      "Convert 850g into kilograms.",
      "A can of soup holds 0.4 litres. How many millilitres is this?",
      "An ant is 6mm long. What is this in centimetres?",
      "A road is 12km long. What is this distance in metres?",
      "A baby weighs 4.1kg at birth. What is this weight in grams?",
      "Convert 325ml into litres.",
      "A door is 198cm high. What is its height in metres?",
      "A sheet of paper is 0.1mm thick. What is this in centimetres?",
      "A running track is 400m. How many laps is a 10km race?",
      "A baker uses 25g of yeast. What is this amount in kilograms?",
      "A fish tank holds 65 litres of water. A bucket holds 5000ml. How many buckets to fill the tank?",
      "A bridge has a weight limit of 7.5 tonnes. How many kilograms is this?",
      "A journey is 250km. How many metres is that?"
    ]
  },
  "convert_metric_imperial": {
    "Year 4": [
      "How many metres are there in a kilometre?",
      "How many minutes are in an hour?",
      "A road is 3km long. How many metres is that?",
      "A film is 120 minutes long. How many hours is that?",
      "A runner runs 5000m. How many kilometres has she run?",
      "A road is 5km long. How many metres is this?",
      "A lesson is 1 hour long. How many minutes is this?",
      "How many metres in 2.5 kilometres?",
      "A film lasts 90 minutes. How many hours and minutes is this?",
      "A runner does a 10km race. How many metres is this?",
      "How many minutes in 3 hours?",
      "Convert 1500m to km.",
      "Change 180 minutes to hours.",
      "A lorry drives 20km. How many metres did it travel?",
      "An exam is 2 hours long. How many minutes do the students have?",
      "A walk is 3000m long. What is this in km?",
      "A TV series is 6 hours long in total. How many minutes is that?",
      "Convert 7km into metres.",
      "How many hours in 240 minutes?",
      "A cyclist travels 15,000m. Convert this to km.",
      "How many minutes in a school day that lasts 6 hours?",
      "If you walk 1km to school and 1km back, how many metres do you walk in total?",
      "Change 30 minutes into a fraction of an hour.",
      "A bridge is 1.2km long. What is its length in metres?",
      "A meeting lasted 75 minutes. How much more than an hour was that?",
      "How many metres are in half a kilometre?",
      "A TV show is 45 minutes long. How much of an hour is this?",
      "A journey is 10km. How many metres is that?",
      "Convert 2 hours 30 minutes into minutes.",
      "A mountain is 3km high. What is its height in metres?",
      "How many hours in a day?",
      "Convert 7500m to kilometres and metres.",
      "A football match is 90 minutes long. How many hours is this?",
      "How many minutes are in 1.5 hours?",
      "A running race is 5km. How many metres do the athletes run?",
      "Change 240 seconds to minutes.",
      "A flight is 4 hours long. How many minutes is the plane in the air?",
      "A river is 8km long. What is this in metres?",
      "How many hours are there in 300 minutes?",
      "Convert 1km and 200m into metres.",
      "A school break is 15 minutes long. What fraction of an hour is this?",
      "How many metres in 1.1km?",
      "A worker's shift is 8 hours. How many minutes do they work?",
      "Change 2.5km into metres.",
      "How many hours and minutes is 100 minutes?",
      "A fence is 20m long. A field is 1km long. How many fences would fit along the field?",
      "Convert 360 minutes into hours.",
      "A film is 2.5 hours long. How many minutes is that?",
      "A cyclist rides for 20km. How many metres is this?",
      "How many seconds in 2 minutes?"
    ],
    "Year 5": [
      "If 1 inch is about 2.5 cm, how many centimetres are in 6 inches?",
      "A bag of sugar weighs 2.2 pounds (lbs). Approximately how many kilograms is this if 1 kg is about 2.2 lbs?",
      "A recipe requires 1 pint of milk. You have a 1-litre carton. Do you have enough? (1 litre ≈ 1.75 pints).",
      "A car is travelling at 50 miles per hour. Is it going faster or slower than a car travelling at 80 kilometres per hour? (5 miles ≈ 8 km).",
      "A man is 6 feet tall. Approximately what is his height in metres? (1 foot ≈ 30cm).",
      "The speed limit is 30 miles per hour. What is this approximately in kilometres per hour? (5 miles ≈ 8 km).",
      "A ruler is 12 inches long. Approximately how long is it in centimetres? (1 inch ≈ 2.5 cm).",
      "A boxer weighs 14 stone. If 1 stone is 14 pounds, what is his weight in pounds?",
      "A recipe asks for 4 ounces of flour. If 1 ounce is about 28g, how many grams do you need?",
      "A garden is 10 yards long. What is this in feet? (1 yard = 3 feet).",
      "A car has a 10-gallon petrol tank. Approximately how many litres is this? (1 gallon ≈ 4.5 litres).",
      "A door is 2 metres high. Is it taller than a man who is 6 feet tall? (1 foot ≈ 30cm).",
      "A bag of potatoes weighs 5 lbs. Approximately what is this in kg? (1 kg ≈ 2.2 lbs).",
      "I need 2 pints of milk. The shop only sells it in litres. Should I buy a 1-litre or 2-litre carton? (1 litre ≈ 1.75 pints).",
      "A road sign says the next town is 16km away. Approximately how many miles is this?",
      "A baby weighs 8 pounds at birth. What is this in ounces? (1 pound = 16 ounces).",
      "A marathon is about 26 miles. A local fun run is 10km. How many fun runs would equal the distance of a marathon?",
      "A table is 4 feet long. What is its length in inches?",
      "A vet weighs a dog and it is 15kg. Approximately what is its weight in pounds?",
      "An American tourist asks for a pint of beer. The barman serves him 500ml. Is this more or less than a pint?",
      "My waist measurement is 32 inches. What is this in cm?",
      "A bottle of perfume holds 50ml. What is this in fluid ounces? (1 fl oz ≈ 28ml).",
      "A plane flies at an altitude of 30,000 feet. What is this in miles? (1 mile = 5280 feet).",
      "A recipe requires the oven to be at 400°F. Your oven is in Celsius. What should you set it to?",
      "The USA measures distance in miles and the UK in miles, but most of Europe uses kilometres. Discuss the advantages of a single system.",
      "A baby weighs 7 pounds. Approximately how many grams is this? (1 pound ≈ 450g)",
      "A carton of juice holds 2 pints. Is this more or less than 1 litre?",
      "A road speed limit is 40 mph. What is this approximately in km/h?",
      "A piece of wood is 3 feet long. How many inches is that?",
      "A car's fuel efficiency is 50 miles per gallon. Approximately what is this in km per litre?",
      "A person is 5 feet 10 inches tall. What is their approximate height in centimetres?",
      "A bag of flour weighs 4 lbs. How many ounces is this?",
      "A US travel guide says a journey is 100 miles. Your car's odometer is in km. What distance should you look for?",
      "A recipe calls for 8 fluid ounces of cream. You have a 250ml pot. Is it enough?",
      "A parcel has a weight limit of 5kg. Your parcel weighs 10 lbs. Can you post it?",
      "The length of a football pitch is 100 yards. What is this in feet?",
      "A pint of milk costs 60p. A litre of milk costs £1. Which is better value if you need 2 litres?",
      "The distance to the moon is about 238,900 miles. What is this in km?",
      "A boxer needs to be under 12 stone to fight. He weighs 75kg. Does he qualify? (1 stone ≈ 6.35kg)",
      "A plank of wood is 2 inches thick. What is this in mm?",
      "A car is travelling at 100 km/h. Is it breaking the UK speed limit of 70 mph?",
      "A recipe from the US uses cups. 1 cup is about 240ml. How many ml in 3 cups?",
      "A farm is 50 acres in size. Is this bigger or smaller than 25 hectares? (1 hectare ≈ 2.5 acres)",
      "An athlete weighs 150 pounds. What is this in stone and pounds?",
      "A bottle of wine holds 75cl. A US bottle holds 25 fluid ounces. Which is larger?",
      "A mountain is 14,000 feet high. How high is this in metres?",
      "A car journey in France is 300km. Approximately how many miles is this?",
      "A steak weighs 8 ounces. What is this in grams?",
      "A garden hose is 50 feet long. Your garden is 15 metres long. Is the hose long enough?",
      "A fish tank holds 20 US gallons. How many litres is that approximately? (1 US gallon ≈ 3.8 litres)"
    ],
    "Year 6": [
      "The distance between two cities is 150 miles. What is this distance in kilometres? (5 miles ≈ 8 km).",
      "A suitcase weighs 23kg. Convert this weight to grams.",
      "A bottle holds 750ml of liquid. What is this in litres?",
      "A marathon is approximately 26 miles. How many kilometres is this?",
      "A car's petrol tank holds 50 litres. Approximately how many gallons is this? (1 gallon ≈ 4.5 litres).",
      "A car travels at an average speed of 40 mph. How long will it take to travel 100 miles?",
      "Convert 2.5kg into grams.",
      "A bottle contains 0.33 litres of water. What is this in millilitres?",
      "Change 1.75m into centimetres.",
      "The distance from London to Edinburgh is approximately 400 miles. What is this in km?",
      "A parcel weighs 3200g. Convert this to kg.",
      "A recipe needs 250ml of cream. The tub contains 0.5 litres. What fraction of the tub is used?",
      "Convert 5 feet and 10 inches into inches only. Then, convert this to cm.",
      "A swimmer swims 20 lengths of a 50m pool. How far is this in kilometres?",
      "A lorry has a maximum load weight of 7.5 tonnes. How many kilograms is this?",
      "Convert a speed of 60km/h into metres per minute.",
      "A piece of wood is 1.05m long. What is its length in millimetres?",
      "An athlete runs 100 metres in 10 seconds. What is their speed in km/h?",
      "A petrol tank holds 55 litres. If the car uses 8 litres per 100km, how far can it travel on a full tank?",
      "Change 4.5 litres into cm³. (1 litre = 1000 cm³).",
      "A map has a scale where 1cm represents 2km. The distance on the map is 8.5cm. What is the real distance?",
      "A baby weighs 3.45kg. What is this weight in grams?",
      "The Earth's circumference is approximately 24,901 miles. Convert this to kilometres.",
      "A medicine requires a dose of 2.5ml. How many doses can you get from a 0.25 litre bottle?",
      "Convert 1 square metre into square centimetres.",
      "A car is travelling at 50 mph. How many miles does it travel in 1 hour and 30 minutes?",
      "Convert 3.2km into metres.",
      "A jug holds 1.5 litres. 400ml is poured out. How much is left in litres?",
      "A person is 6 feet 2 inches tall. What is their approximate height in cm? (1 inch ≈ 2.54cm)",
      "The speed of light is approximately 300,000 km per second. How far does it travel in a minute?",
      "A field is 2.5 hectares. How many square metres is this? (1 hectare = 10,000 m²)",
      "Convert 0.75kg into grams.",
      "A journey of 200 miles starts with a full 12-gallon tank of petrol. The car does 40 miles per gallon. How much petrol is left at the end?",
      "Change 1 hour 45 minutes into a decimal of hours.",
      "A box has a volume of 2.5m³. How many litres can it hold? (1m³ = 1000 litres)",
      "Convert a speed of 30 metres per second into kilometres per hour.",
      "A parcel weighs 4.5 lbs. What is its approximate weight in kilograms? (1kg ≈ 2.2 lbs)",
      "A recipe needs 8 ounces of cheese. How many grams is this? (1 ounce ≈ 28.35g)",
      "The area of a room is 20 square yards. What is this in square feet? (1 yard = 3 feet)",
      "Convert 1.2 cubic metres into cubic centimetres.",
      "A flight from London to New York is approximately 3460 miles. How long would this take at an average speed of 550 mph?",
      "A medicine dosage is 5ml per 10kg of body weight. What is the dose for a person weighing 11 stone? (1 stone ≈ 6.35kg)",
      "Convert 25°C to Fahrenheit. F = (C * 9/5) + 32.",
      "A car travels 80km in 1 hour. How many metres does it travel in 1 second?",
      "The density of gold is 19.3 g/cm³. What is the mass of a gold bar with a volume of 100cm³?",
      "Convert 1 year into seconds.",
      "A pressure of 1 bar is approximately 14.5 psi. What is 30 psi in bar?",
      "The distance of a marathon (26.2 miles) is run by a top athlete in about 2 hours 5 minutes. What is their average speed in mph?",
      "A bottle contains 0.7 litres of liquid. What is this in millilitres?",
      "Convert 5 tonnes to kilograms."
    ]
  },
  "perimeter_area": {
    "Year 3": [
      "A square has sides of 5cm. What is its perimeter?",
      "A rectangle has a length of 8cm and a width of 4cm. What is its perimeter?",
      "Draw a shape with a perimeter of 12cm on squared paper.",
      "The school playground is a rectangle. One side is 20m long and the other is 15m long. What is the perimeter of the playground?",
      "If you walk all the way around a square park with sides of 50m, how far have you walked?",
      "The perimeter of a square is 20cm. How long is each side?",
      "Draw a rectangle with a perimeter of 14cm.",
      "A triangular field has sides of 30m, 40m, and 50m. What is its perimeter?",
      "Measure the perimeter of the cover of your reading book.",
      "An octagon has 8 equal sides of 3cm each. What is its perimeter?",
      "The school hall is a rectangle 30m long and 15m wide. What is its perimeter?",
      "I have a piece of string 25cm long. Can I use it to go all the way around a square with 6cm sides?",
      "Find the perimeter of a regular hexagon with sides of 10cm.",
      "The perimeter of a rectangle is 18cm. Its length is 6cm. What is its width?",
      "Walk around the edge of the school playground. You have just walked its perimeter.",
      "A farmer wants to put a fence around a field. The sides are 100m, 120m, 80m and 90m. How much fencing does he need?",
      "Measure the sides of a 50p coin and estimate its perimeter.",
      "Draw two different shapes that both have a perimeter of 16cm.",
      "The perimeter of an equilateral triangle is 21cm. How long is each side?",
      "A photo frame is 20cm long and 15cm wide. What is the total length of wood needed to make it?",
      "Find the perimeter of your classroom.",
      "A rectangle's perimeter is 22m. What could its length and width be?",
      "If I run around a square park twice and the side of the park is 100m, how far have I run?",
      "Measure the perimeter of a CD case.",
      "A garden is in the shape of a regular pentagon with sides of 8m. What is its perimeter?",
      "A triangle has sides of 6cm, 7cm and 8cm. What is its perimeter?",
      "Calculate the perimeter of a rectangle that is 10cm long and 5cm wide.",
      "A square garden has a perimeter of 24m. What is the length of one side?",
      "Measure the perimeter of a postcard.",
      "A five-sided shape has sides of 4cm, 5cm, 6cm, 4cm, and 5cm. What is the perimeter?",
      "A rectangular swimming pool is 25m long and 10m wide. What is its perimeter?",
      "The perimeter of a regular octagon is 40cm. How long is each side?",
      "Draw a shape on squared paper and calculate its perimeter by counting the squares around the edge.",
      "A book cover measures 20cm by 15cm. What is its perimeter?",
      "A farmer puts a fence around a square field. If one side is 120m, how much fencing is needed?",
      "An equilateral triangle has a perimeter of 30cm. What is the length of one side?",
      "A rectangular room is 5m long and 4m wide. What is the perimeter of the room?",
      "Find the perimeter of a hexagon with equal sides of 9cm.",
      "A shape has a perimeter of 18cm. All its sides are 3cm long. What is the shape?",
      "Measure the perimeter of the interactive whiteboard in your classroom.",
      "A rectangular photo has a length of 12cm and a width of 7cm. What is its perimeter?",
      "A square has a side length of 11m. What is its perimeter?",
      "A playground is a rectangle with a perimeter of 100m. If the length is 30m, what is the width?",
      "Calculate the perimeter of a triangle with sides 12cm, 15cm, and 17cm.",
      "A field has a perimeter of 200m. A farmer walks around it three times. How far does he walk?",
      "Draw an irregular shape and measure its perimeter.",
      "A rectangle has a perimeter of 26cm and a length of 8cm. Find its width.",
      "What is the perimeter of a regular pentagon with 6cm sides?",
      "Measure the perimeter of a tablet or phone screen.",
      "A dog lead is 2m long. If you use it to make a square on the ground, what is the perimeter?"
    ],
    "Year 4": [
      "Find the area of a rectangle with sides 6cm and 4cm by counting squares.",
      "Calculate the perimeter of a rectangle that is 12m long and 5m wide.",
      "A square has a perimeter of 24cm. What is the length of one of its sides?",
      "Draw a rectilinear shape on squared paper and find its area and perimeter.",
      "A farmer's field is 100m long and 50m wide. What is its perimeter?",
      "A square has an area of 25cm². What is the length of its side?",
      "A rectilinear shape is made of two rectangles. One is 3cm by 4cm, the other is 5cm by 2cm. What is the total area?",
      "Find the area of your classroom floor in square metres (by counting floor tiles or measuring).",
      "A swimming pool is 25m long and 10m wide. What is its perimeter?",
      "The area of a rectangle is 24m². What could its length and width be? Give two examples.",
      "On squared paper, draw a shape with an area of 15 squares and find its perimeter.",
      "A football pitch is 100m long and 60m wide. What is its area?",
      "Find the perimeter of an L-shaped room with given dimensions.",
      "A garden has an area of 30m². A patio with an area of 5m² is built in it. What is the area of the remaining garden?",
      "Draw a shape that has a perimeter of 20cm and an area of 9cm².",
      "The perimeter of a square is 32cm. What is its area?",
      "A window is made of 12 square panes of glass. Each pane is 20cm by 20cm. What is the total area of the window?",
      "Find the area of the letter 'T' drawn on 1cm squared paper.",
      "A wall is 5m long and 3m high. What is its area?",
      "A rug is 2m by 3m. Will it fit in a room with an area of 10m²?",
      "Calculate the perimeter of a cross shape made from 5 squares, each with a side of 3cm.",
      "Find the area of a photograph that is 6 inches by 4 inches.",
      "A farmer has 40m of fencing. What is the largest rectangular area he can enclose?",
      "A rectangle has a length of 9cm and a perimeter of 30cm. What is its area?",
      "Count the squares to find the approximate area of a circle drawn on squared paper.",
      "A rectangular garden is 15m long and 10m wide. What is its perimeter and area?",
      "Find the area of an L-shaped room by splitting it into two rectangles.",
      "The area of a square is 49cm². What is its perimeter?",
      "Draw a rectilinear shape with an area of 18 squares. What is its perimeter? Can you draw another with the same area but a different perimeter?",
      "A piece of paper is 30cm long and 20cm wide. What is its area?",
      "Calculate the perimeter of a rectilinear shape with sides of 8m, 5m, 3m, 2m, 5m and 3m.",
      "A floor is tiled with square tiles. If the floor is 10 tiles long and 8 tiles wide, what is the area in tiles?",
      "A rectangle has a perimeter of 28cm. Its width is 4cm. What is its length and area?",
      "Find the area of the letter 'H' on squared paper.",
      "A dog run is 12m long and 3m wide. What is its area?",
      "The perimeter of a rectangular field is 180m. The length is 50m. What is the width?",
      "Count the squares to find the area of an irregular shape like a leaf.",
      "A small patio is made of 30 square slabs, each 1m by 1m. What is the area of the patio?",
      "A square has a perimeter of 44cm. What is its area?",
      "A room is 6m by 4m. A rug in the room is 3m by 2m. What is the area of the floor not covered by the rug?",
      "Calculate the area of a composite shape made from a 5cm x 5cm square and a 3cm x 2cm rectangle.",
      "A school hall has a perimeter of 80m. It is 25m long. What is its width and area?",
      "Find the area of the letter 'E' drawn on 1cm grid paper.",
      "A rectangular vegetable patch is 8m long and has an area of 40m². What is its width?",
      "Calculate the perimeter of a 'plus' sign shape made from 5 identical squares of side 2cm.",
      "A swimming pool is 25m long and 12m wide. What is the area of the water's surface?",
      "A rectangle has an area of 36cm². What are the possible whole number lengths and widths?",
      "Find the area of a rectilinear shape by subtracting a missing part from a larger rectangle.",
      "The area of a square is 81m². What is the length of its side?",
      "A path is 10m long and 2m wide. What is its area?"
    ],
    "Year 5": [
      "A composite rectilinear shape is made from two rectangles. One is 5cm by 3cm and the other is 6cm by 4cm. What is the total area?",
      "Calculate the perimeter of an L-shaped room with given side lengths.",
      "The area of a square is 36cm². What is the length of one of its sides?",
      "Estimate the area of an irregular shape (like a leaf) by drawing it on squared paper and counting the squares.",
      "A rectangle has a perimeter of 30m. If its length is 10m, what is its width?",
      "Calculate the area of a rectangle with a length of 12m and a width of 7m.",
      "The perimeter of a regular hexagon is 48cm. What is the length of one side?",
      "A composite shape is formed by a 5m x 5m square and a 3m x 8m rectangle. Find its total area and perimeter.",
      "A rectangular field is 80m long and has a perimeter of 260m. What is its width?",
      "Draw an irregular shape and estimate its area by counting squares.",
      "The area of a rectangle is 45cm². Its width is 5cm. What is its length and perimeter?",
      "Compare the areas of two school playing fields. Which is larger?",
      "A room is 5.5m long and 4m wide. What is its area?",
      "A path 1m wide is built around a rectangular lawn that is 10m by 8m. What is the area of the path?",
      "A square has an area of 64m². What is its perimeter?",
      "Calculate the perimeter of a shape made of two equilateral triangles joined along one side, where each side is 6cm.",
      "A tablecloth measures 2m by 1.5m. What is its area?",
      "Estimate the area of your hand in cm².",
      "A rectangular swimming pool has an area of 250m². If it is 25m long, how wide is it?",
      "A small photo is 10cm by 15cm. It is enlarged so each side is doubled. What is the new area and perimeter?",
      "A garden is L-shaped. The lengths of the six sides are given. Calculate the perimeter and area.",
      "Find the area of a classroom with dimensions 7.2m by 8.5m.",
      "The perimeter of a rectangle is 34cm. Its area is 60cm². What are its dimensions?",
      "A piece of A4 paper is approximately 30cm by 21cm. What is its approximate area?",
      "A wall is 6m by 2.5m. A door in the wall is 2m by 0.8m. What is the area of the wall to be painted?",
      "Calculate the area of a rectangle that is 1.5m long and 0.8m wide.",
      "A square has a perimeter of 100cm. What is its area?",
      "A composite shape is made of a rectangle 10cm by 6cm, with a square of side 3cm removed from one corner. What is the area and perimeter of the new shape?",
      "Estimate the area of a puddle by drawing it on squared paper.",
      "A football pitch has an area of 7140m². It is 105m long. What is its width?",
      "The perimeter of a regular octagon is 64cm. What is the length of one side?",
      "Calculate the area of a room that is 4.5m by 3.5m.",
      "A rectangular garden is 20m long. Its area is 300m². Find the perimeter of the garden.",
      "A shape is made from three identical squares of side 5cm joined in a row. What is the perimeter of the shape?",
      "Estimate the area of a local park in square metres.",
      "The area of a square is 144cm². What is its perimeter?",
      "A rectangular swimming pool is 25m by 10m. It is surrounded by a path that is 2m wide. What is the area of the path?",
      "Calculate the perimeter of a composite rectilinear shape with given side lengths.",
      "A rectangle has an area of 0.5m². What could its dimensions be in cm?",
      "A farmer has a field that is 120m by 80m. What is its area in square metres?",
      "A window is 1.2m wide and 1.5m high. What is its area?",
      "The perimeter of a rectangular room is 18m. Its length is 5.5m. What is its area?",
      "A composite shape has an area of 50cm². It is made of two rectangles. One has an area of 20cm². What is the area of the second?",
      "Estimate the surface area of a large lake.",
      "A square piece of card has a perimeter of 60cm. What is its area?",
      "A kitchen floor is 5m by 3m. Floor tiles are 50cm by 50cm. How many tiles are needed?",
      "Calculate the perimeter and area of a T-shaped room.",
      "A rectangle has an area of 48cm² and a perimeter of 28cm. What are its dimensions?",
      "A wall is 7m long and 2.5m high. A window on the wall is 1.5m by 1m. What is the area of the brickwork?",
      "A regular pentagon has a perimeter of 75cm. How long is each side?"
    ],
    "Year 6": [
      "Calculate the area of a triangle with a base of 10cm and a height of 6cm.",
      "A parallelogram has a base of 8m and a perpendicular height of 5m. What is its area?",
      "A shape has an area of 20cm². Can you draw two different shapes (a rectangle and a triangle) that both have this area?",
      "The living room in a house is a rectangle 6m long and 4m wide. The hallway is a rectangle 5m long and 1.5m wide. What is the total area of both rooms?",
      "Recognise that a rectangle with a perimeter of 16cm could have sides of 4cm and 4cm (area 16cm²) or 6cm and 2cm (area 12cm²).",
      "A triangle has an area of 24cm² and a base of 8cm. What is its perpendicular height?",
      "Find the area of a parallelogram with a base of 12m and a height of 7m.",
      "Draw two different rectangles that both have a perimeter of 18cm. Which one has the larger area?",
      "Calculate the area of a right-angled triangle with sides 5cm, 12cm, and 13cm.",
      "The area of a parallelogram is 50m². Its height is 4m. What is the length of its base?",
      "A triangular sail has a base of 4m and a height of 5m. What is its area?",
      "A shape is made from a rectangle and a triangle. Calculate the total area.",
      "A garden is in the shape of a parallelogram. The base is 15m and the perpendicular distance between the parallel sides is 10m. What is the area of the garden?",
      "A rhombus can be split into two identical triangles. Find the area of a rhombus with given diagonal lengths.",
      "Compare the area of a square with side length 4cm and a triangle with base 8cm and height 4cm.",
      "A logo is designed using a triangle and a parallelogram. Find its total area.",
      "A field in the shape of a triangle has a base of 100m and a height of 60m. What is its area in square metres?",
      "Can a triangle have the same area as a parallelogram? Explain how.",
      "The two parallel sides of a trapezium are 10cm and 14cm, and the height is 6cm. Find its area.",
      "A rectangular room has an area of 24m². A triangular rug placed in the room has an area of 6m². What fraction of the floor is covered by the rug?",
      "Find the area of a composite shape made from three different triangles.",
      "A kite is made from two triangles. One has a height of 20cm and the other 40cm. Both have a base of 30cm. What is the total area?",
      "The perimeter of a rectangle is 28cm. The area of a triangle is 12cm². Can you determine if one is larger than the other?",
      "A plot of land is a parallelogram with a base of 50m. The area is 1000m². What is its perpendicular height?",
      "Explain why two shapes can have the same area but different perimeters.",
      "A right-angled triangle has a base of 7cm and a height of 8cm. What is its area?",
      "The area of a triangle is 30m². Its height is 6m. What is the length of its base?",
      "A parallelogram has an area of 45cm² and a base of 9cm. What is its perpendicular height?",
      "A rectangular garden is 12m by 8m. A triangular pond with a base of 4m and height of 3m is in the middle. What is the area of the grass?",
      "Draw a rectangle with a perimeter of 24cm and the largest possible area.",
      "A triangular piece of paper has a height of 15cm and a base of 10cm. What is its area?",
      "The area of a parallelogram is 72m². What could its base and height be? (Give two examples).",
      "A shape is made of a 10cm x 8cm rectangle with a triangle of base 8cm and height 5cm on top. What is the total area?",
      "True or false: If you double the sides of a rectangle, you double its area and its perimeter.",
      "Find the area of a triangle with a base of 2.5m and a height of 4m.",
      "A parallelogram has a perimeter of 30cm. Two of its sides are 10cm long. What are the lengths of the other two sides?",
      "A garden is a trapezium with parallel sides of 20m and 30m, and a height of 15m. What is its area?",
      "A shape with an area of 100cm² can have different perimeters. Give an example of two shapes.",
      "The side of a building is a triangle on top of a square. The square is 10m x 10m. The triangle has a base of 10m and a height of 6m. Find the total area.",
      "The area of a triangle is 18cm². Its base and height are equal. What is their length?",
      "Calculate the area of a parallelogram with a base of 1.5m and a height of 2m.",
      "A rectangular flag is 3m by 2m. It has a diagonal stripe that forms two triangles. What is the area of each triangle?",
      "A room is a rectangle (5m x 4m) with a triangular bay window (base 3m, height 1.5m). What is the total floor area?",
      "Why is the area of a triangle half of base times height?",
      "Find the area of a rhombus with diagonals of 10cm and 16cm.",
      "A rectangular field has an area of 1 hectare (10,000m²). It is 200m long. What is its perimeter?",
      "A triangle and a parallelogram have the same base and the same area. What is the relationship between their heights?",
      "The perimeter of a rectangle is the same as the perimeter of a 10cm side square. The rectangle is 12cm long. What is its area?",
      "Find the area of a composite shape by enclosing it in a larger rectangle and subtracting the missing parts."
    ]
  },
  "volume": {
    "Year 5": [
      "Using 1cm³ blocks, build a cuboid that is 3 blocks long, 2 blocks wide, and 2 blocks high. What is its volume?",
      "Estimate which of two containers has a greater capacity by pouring water from one to the other.",
      "If a box has a volume of 24cm³, what could its dimensions be?",
      "Look at a picture of a cuboid made from centimetre cubes. Can you work out its volume?",
      "Estimate the volume of your lunchbox.",
      "How many 1cm³ cubes would you need to make a 2cm by 3cm by 4cm cuboid?",
      "Estimate the capacity of a drinking glass in millilitres.",
      "If you have 100 centimetre cubes, what are the dimensions of three different cuboids you could make?",
      "A box is filled with 1cm³ cubes. It has 4 layers and each layer has 12 cubes. What is the volume?",
      "Look at a carton of juice. What is its volume/capacity as written on the label?",
      "Estimate the volume of your pencil case.",
      "A fish tank is a cuboid. You pour in 10 litres of water. What is the volume of the water in cm³?",
      "Build a shape with a volume of 18cm³ using interlocking cubes.",
      "Estimate, then measure, how many spoonfuls of rice it takes to fill a small container.",
      "A Rubik's cube is 3x3x3 small cubes. What is its volume in cubes?",
      "If a cuboid has a volume of 30cm³, what could its length, width and height be?",
      "Estimate the volume of a shoebox.",
      "Compare the capacity of a mug and a teacup. Which holds more?",
      "A box contains 16 smaller cubes. What could the arrangement of cubes be?",
      "A jug holds 1 litre of water. If you pour out 300ml, what volume of water is left?",
      "Build a cube with side lengths of 4cm using 1cm³ blocks. How many blocks did you use?",
      "Estimate the volume of a brick.",
      "If 500ml of water is poured into a 1-litre container, what percentage of the container is full?",
      "A pack of sugar cubes contains 48 cubes arranged in a cuboid shape. What could the dimensions of the pack be?",
      "Does a larger object always have a larger volume? Discuss (e.g., a beach ball vs a brick).",
      "A cuboid is made from 36 centimetre cubes. What could its length, width and height be?",
      "Estimate the capacity of a bathtub in litres.",
      "How many 1cm³ cubes are needed to make a cube with sides of 5cm?",
      "A shape is made of 5 layers of cubes. Each layer is a 3 by 4 rectangle. What is the volume?",
      "Estimate the volume of a can of baked beans in cm³.",
      "A box has a volume of 12 cubes. Sketch two possible cuboids with this volume.",
      "A swimming pool is half full. Its total capacity is 50,000 litres. What volume of water is in the pool?",
      "Build a shape with a volume of 20cm³. How many cubes did you use?",
      "Estimate the volume of your classroom in cubic metres.",
      "A box is 10cm long, 5cm wide, and 4cm high. How many 1cm³ cubes will it hold?",
      "If a cuboid has a volume of 40cm³, give two sets of possible dimensions (length, width, height).",
      "Estimate the capacity of a car's petrol tank in litres.",
      "A large cube is made from 27 small cubes. What are the dimensions of the large cube?",
      "A glass contains 250ml of water. A jug contains 1 litre. Estimate how many glasses you can fill from the jug.",
      "A box of chocolates has two layers. Each layer has 12 chocolates. If each chocolate is roughly a 2cm cube, estimate the volume of the box.",
      "A cuboid is built with 30 cubes. The base is 5 cubes long and 2 cubes wide. How high is it?",
      "Estimate the volume of a single Lego brick.",
      "A paddling pool takes 10 buckets of water to fill. If a bucket holds 5 litres, what is the capacity of the pool?",
      "A shape has a volume of 16cm³. Can it be a cube with whole number sides?",
      "Estimate the capacity of a cereal box in cm³.",
      "A tower is made from 1cm³ cubes. It is 8 cubes high, 3 cubes long, and 3 cubes wide. What is its volume?",
      "Which has a larger volume: a football or a rugby ball? How could you test your estimate?",
      "A box can hold 100 sugar cubes. If the box is 10 cubes long and 5 cubes wide, how many layers are there?",
      "Estimate the volume of water you drink in a day.",
      "A cuboid has a volume of 72cm³. Its length is 6cm and width is 4cm. How high is it?"
    ],
    "Year 6": [
      "Calculate the volume of a cuboid with a length of 8cm, a width of 5cm, and a height of 4cm.",
      "A cube has a side length of 6cm. What is its volume?",
      "A fish tank is 50cm long, 30cm wide, and 20cm high. What is its volume in cm³?",
      "How many 1cm³ cubes would you need to make a 3cm by 3cm by 3cm cube?",
      "A box has a volume of 60m³. If its length is 5m and its width is 4m, what is its height?",
      "A cereal box has dimensions of 20cm by 30cm by 5cm. What is its volume?",
      "Find the volume of a cube with edges of 10cm.",
      "A swimming pool is 25m long, 10m wide, and 2m deep. What volume of water does it hold in cubic metres?",
      "The volume of a cuboid is 72cm³. Its length is 6cm and its width is 3cm. What is its height?",
      "How many 1cm³ cubes can fit into a box that is 10cm by 5cm by 4cm?",
      "A concrete block has a volume of 8000cm³. What is this in litres?",
      "Compare the volume of a cube with 5cm sides and a cuboid measuring 4cm x 5cm x 6cm.",
      "An aquarium is 60cm long, 30cm wide, and 40cm high. If it is half full, what is the volume of the water?",
      "A lorry's container is 10m long, 2.5m wide, and 3m high. What is its volume?",
      "A small box has a volume of 100cm³. A large box has dimensions that are double the small box. What is the volume of the large box?",
      "A wooden beam is 2m long, 10cm wide, and 5cm thick. Find its volume in cm³.",
      "A storage unit has a volume of 30m³. What could its dimensions be?",
      "Calculate the volume of your classroom in cubic metres.",
      "A set of 4 identical books forms a stack that is 20cm long, 15cm wide and 12cm high. What is the volume of a single book?",
      "A cube has a volume of 125cm³. What is the length of one of its sides?",
      "A removal van has a storage space of 25m³. Can it fit the contents of a flat with a total volume of 22m³?",
      "A fish tank has a base area of 2000cm². If water is poured in to a depth of 30cm, what is the volume of the water?",
      "Convert 1 cubic metre (m³) into cubic centimetres (cm³).",
      "A block of cheese is a cuboid measuring 10cm x 8cm x 5cm. If a piece with a volume of 80cm³ is cut off, what is the volume of the remaining cheese?",
      "Estimate the volume of air in a bus.",
      "A cuboid has a length of 1.5m, a width of 0.5m, and a height of 1m. What is its volume in m³?",
      "What is the volume of a cube with a side length of 20mm?",
      "A shipping container is 12m long, 2.5m wide, and 3m high. What is its volume?",
      "The volume of a box is 200cm³. Its base is 10cm by 5cm. What is its height?",
      "How many 2cm x 2cm x 2cm cubes could fit into a 10cm x 10cm x 10cm box?",
      "A garden bed is 5m long, 1m wide, and 0.5m deep. What volume of soil is needed to fill it in cubic metres?",
      "A cube has a volume of 27m³. What is the length of one of its edges?",
      "A paddling pool is 2m long, 1.5m wide, and is filled to a depth of 0.4m. What is the volume of water in the pool?",
      "A box of tea bags is 14cm long, 7cm high, and 5cm wide. Calculate its volume.",
      "A lorry can carry a volume of 60m³. How many boxes with a volume of 1.5m³ can it carry?",
      "A room has a volume of 75m³. It is 5m long and 5m wide. How high is the ceiling?",
      "Calculate the volume of a cube with a side length of 0.5m. Give your answer in cm³.",
      "A block of ice measures 30cm by 20cm by 15cm. What is its volume?",
      "A fish tank has a volume of 90 litres. What could its dimensions be in cm? (1 litre = 1000cm³)",
      "A cube has a surface area of 54cm². What is its volume?",
      "A swimming pool is 50m long and 20m wide. If it holds 1500m³ of water, what is its average depth?",
      "What is the volume of a cuboid with dimensions 12mm, 2cm, and 0.5m? Give your answer in cm³.",
      "The volume of a large box is 1m³. The volume of a small box is 1cm³. How many small boxes fit in the large one?",
      "A water tank is 3m long, 2m wide and 1.5m high. It is 2/3 full. What is the volume of water in the tank?",
      "A cuboid has a volume of 300cm³. Its length is 10cm and its height is 5cm. What is its width?",
      "Estimate, then calculate, the volume of a refrigerator.",
      "A cube has a volume of 1000cm³. What is the area of one of its faces?",
      "A sandpit is 2.5m by 2m by 0.3m. What is the volume of sand it can hold?",
      "Two cuboids have the same volume. One is 4x5x6cm. The other has a base of 3x5cm. What is its height?",
      "Calculate the volume of air in your classroom in cubic metres."
    ]
  },
  "solve_problems_money_length_mass_weight_capacity_volume": {
    "Year 2": [
      "I have 50p. I buy an apple for 20p. How much money do I have left?",
      "A ribbon is 30cm long. I cut off 10cm. How much is left?",
      "A bag of sweets weighs 100g. I eat 30g. What is the weight of the sweets left in the bag?",
      "A cup holds 200ml of water. If I drink half of it, how much is left?",
      "Leo has £20. He buys two cinema tickets that cost £7 each. How much money does he have left?",
      "A pencil costs 15p. A rubber costs 10p. How much for both?",
      "My plant was 8cm tall. It grew 5cm more. How tall is it now?",
      "I have a 100g bag of crisps. I share it equally with a friend. How many grams do we get each?",
      "A bottle holds 500ml of water. I drink 100ml. How much is left?",
      "I have £1. A book costs 80p. Do I have enough money? How much change?",
      "A piece of string is 25cm long. I need a piece 30cm long. How much more do I need?",
      "An apple weighs 90g. A banana weighs 110g. What is their total weight?",
      "A cup holds 150ml. How much do two cups hold?",
      "A comic costs 75p. I pay with three 20p coins and three 5p coins. Is this correct?",
      "A tower of blocks is 40cm high. I add 3 more blocks that are each 2cm high. What is the new height?",
      "A cake weighs 500g. If I cut it into 10 equal slices, how much does each slice weigh?",
      "A car has 4 wheels. How many wheels on 5 cars?",
      "I have 60p. Sweets are 5p each. How many can I buy?",
      "My sunflower is 1m tall. My friend's is 85cm tall. What is the difference in height?",
      "A bag contains 1kg of sugar. I use half of it. How many grams are left?",
      "A bottle of lemonade holds 1 litre. A glass holds 200ml. How many full glasses can I pour?",
      "I buy stickers for 25p and a pen for 30p. How much change from £1?",
      "A running track is 100m long. How far is it to run around it three times?",
      "A dog weighs 12kg. A cat weighs 5kg. How much heavier is the dog?",
      "A jug of juice holds 800ml. I pour 250ml into a glass. How much is left in the jug?",
      "A toy car costs 70p. How much change do I get from a £1 coin?",
      "A snake is 45cm long. It grows another 15cm. How long is it now?",
      "A bag of apples weighs 1kg. I take out two apples weighing 100g each. What is the new weight?",
      "A bucket holds 10 litres of water. I use 3 litres to water the plants. How much is left?",
      "I have £2. I buy a magazine for £1.50. How much do I have left?",
      "A fence is 10m long. I add another 5m section. What is the total length?",
      "A box of cereal weighs 500g. The box itself weighs 50g. What is the weight of the cereal?",
      "A can of pop holds 330ml. How much do two cans hold?",
      "I save 20p every day for 5 days. How much have I saved?",
      "My desk is 80cm wide. My friend's desk is 70cm wide. What is the difference?",
      "A bag of flour weighs 1kg. A recipe needs 200g. How much is left?",
      "A jug has 600ml of juice. I share it equally between 3 glasses. How much is in each glass?",
      "A ticket to the zoo costs £10. How much for a family of four?",
      "A plant is 25cm tall. It needs to grow another 25cm to reach the window. How high is the window?",
      "A bag of carrots weighs 500g. A bag of potatoes weighs 1kg. What is the total weight?",
      "A bottle contains 1 litre of water. I pour it into 100ml cups. How many cups can I fill?",
      "A teddy costs £5. A doll costs £8. What is the total cost?",
      "A piece of wool is 1m long. I cut it in half. How many cm is each piece?",
      "I have 2kg of dog food. My dog eats 100g a day. How many days will the food last?",
      "A swimming pool is 25m long. I swim two lengths. How far have I swum?",
      "A bar of chocolate costs 65p. How much change from £1?",
      "A tower is 50cm high. I take off a 10cm block. How high is it now?",
      "A recipe needs 100g of butter. I have a 250g block. How much is left?",
      "A watering can holds 2 litres. It is half full. How many ml of water are in it?",
      "A film is 90 minutes long. A TV show is 30 minutes long. What is the difference in duration?"
    ],
    "Year 3": [
      "A t-shirt costs £5.50 and a pair of shorts costs £4.75. How much do they cost altogether?",
      "My journey to school is 2km. I have walked 800m. How much further do I have to go?",
      "A baker has 1kg of flour. He uses 450g to make a cake. How much flour is left?",
      "A bottle of juice contains 1 litre. I pour out a 250ml glass. How much is left in the bottle?",
      "If I pay for a £2.80 magazine with a £5 note, how much change will I get?",
      "A CD costs £7.99. A DVD costs £9.50. What is the total cost?",
      "A plank of wood is 3m long. I cut off a piece that is 120cm. How much is left in metres?",
      "A recipe needs 350g of flour from a 1kg bag. How much flour will be left in the bag?",
      "I have a 2-litre bottle of cola. I drink 400ml. How much is left?",
      "I buy a book for £4.80 and pay with a £10 note. What is my change?",
      "A fence is made of panels that are 1.8m long. How long would a fence with 10 panels be?",
      "A baker makes 2kg of dough. He divides it into 10 equal loaves. What is the weight of each loaf in grams?",
      "A car's petrol tank holds 50 litres. It currently contains 15 litres. How much is needed to fill it?",
      "Cinema tickets are £5.25 for adults and £3.50 for children. How much for one adult and two children?",
      "A snail crawls 35cm in one minute. How far will it crawl in 5 minutes?",
      "A box of 6 eggs weighs 300g. What is the approximate weight of one egg?",
      "A swimming pool contains 10,000 litres of water. 1,500 litres are drained. How much is left?",
      "A pack of pens costs £2.40. There are 6 pens in the pack. What is the cost per pen?",
      "The distance from my house to the park is 1.5km. How far is the round trip in metres?",
      "A watermelon weighs 2.5kg. A pineapple weighs 1.2kg. How much heavier is the watermelon?",
      "I need 1 litre of orange juice. I have one carton of 250ml and another of 400ml. How much more do I need?",
      "A café sells coffee for £2.60 and tea for £1.90. How much more does the coffee cost?",
      "A tower is 45m high. A nearby flagpole is 12.5m high. What is the difference in height?",
      "I need 1kg of potatoes. The bag I pick up weighs 1350g. How many grams do I need to remove?",
      "A bucket holds 10 litres. It has a hole and is losing 50ml every minute. How much will be left after 10 minutes?",
      "A football costs £9.50. A child has £7.80. How much more money do they need?",
      "A piece of rope is 5m long. 2m 50cm is cut off. How much is left?",
      "A bag of apples weighs 1.5kg. A bag of oranges weighs 1.2kg. What is the total weight?",
      "A recipe requires 300ml of milk. A carton holds 1 litre. How much milk is left after making the recipe?",
      "I have a £20 note. I buy a book for £8.99 and a magazine for £3.50. How much change do I get?",
      "A marathon is 26 miles long. A runner has completed 10 miles. How much further to go?",
      "A cake weighs 1.2kg. It is cut into 10 equal slices. What is the weight of one slice in grams?",
      "A bathtub holds 80 litres of water. A shower uses 35 litres. How much water is saved by having a shower?",
      "A train ticket for an adult is £12. A child's ticket is half price. What is the cost for two adults and one child?",
      "A room's perimeter is 18m. It is a rectangle with a length of 5m. What is the width?",
      "A box of cereal weighs 750g. A family eats 50g each day. How many days does the box last?",
      "A can of paint holds 2.5 litres. A wall needs 1.8 litres for one coat. Is there enough for two coats?",
      "I need £30 for a trip. I have saved £17.50. How much more do I need to save?",
      "A plank of wood is 2.4m long. It is cut into 3 equal pieces. How long is each piece in cm?",
      "A farmer has a 1 tonne bag of feed. He uses 50kg a day. How many days will it last?",
      "A bottle contains 1.5 litres of lemonade. It is shared equally among 6 children. How many ml does each child get?",
      "A film starts at 6:30 pm and lasts for 95 minutes. What time does it finish?",
      "A tree is 8m tall. It grows by 75cm in a year. How tall is it now?",
      "A bag of rice weighs 2kg. 600g is used. How much is left in the bag?",
      "A fish tank is filled with 35 litres of water. Its capacity is 50 litres. How much more water is needed to fill it?",
      "A comic costs £1.75. How much would 4 comics cost?",
      "The journey to school is 3km. How many metres is this?",
      "A recipe needs 0.5kg of flour. I have a 1kg bag. What fraction is left?",
      "A water butt holds 200 litres. After a rainstorm, it is 3/4 full. How many litres are in it?",
      "A football match lasts 90 minutes with a 15 minute half-time break. If it kicks off at 3:00 pm, what time does it end?"
    ],
    "Year 4": [
      "I buy three items costing £1.20, 75p, and £2.50. What is the total cost?",
      "A rectangular field has a perimeter of 120m. One side is 40m long. What is the length of the other side?",
      "A recipe for 4 people needs 500g of pasta. How much pasta would you need for 8 people?",
      "A swimming pool is 25m long. How many lengths do you need to swim to complete 1km?",
      "A bottle of lemonade holds 2 litres. How many 250ml glasses can be filled from it?",
      "A school trip costs £12.50 per child. How much will it cost for a class of 30 children?",
      "The perimeter of a rectangular field is 300m. If the length is 100m, what is the area of the field?",
      "A cake recipe for 6 people requires 300g of flour. How much flour is needed for 9 people?",
      "A family travels 150km. They stop for a break after 80km. What fraction of the journey is left?",
      "I bought 4 items costing 75p, £1.25, £2.10, and 90p. I paid with a £10 note. How much change did I get?",
      "A rectangular room measures 4m by 5m. Carpet costs £15 per square metre. How much will it cost to carpet the room?",
      "A runner runs 8 laps of a 400m track. How many kilometres has she run?",
      "A 2-litre bottle of squash is shared between 8 children. How many millilitres does each child get?",
      "A book has 300 pages. I have read 120 pages. What percentage of the book have I read?",
      "Three friends have lunch. The bills are £8.50, £10.20, and £7.70. They split the total cost equally. How much do they each pay?",
      "A wall measuring 6m by 3m needs two coats of paint. One litre of paint covers 9m². How many litres are needed?",
      "A car travels 10km on 1 litre of petrol. How much petrol is needed for a 250km journey?",
      "A pack of 8 biscuits weighs 200g. What is the weight of one biscuit?",
      "A film starts at 19:20 and finishes at 21:05. How long is the film?",
      "A shop has a sale with 25% off. How much would a £40 coat cost in the sale?",
      "Find the area of a garden that is 12.5m long and 8m wide.",
      "A box contains 48 chocolates. The box weighs 600g. If the box itself weighs 120g, what is the average weight of a chocolate?",
      "How many 300ml glasses can be filled from a 1.5-litre jug?",
      "A train journey costs £35. A railcard gives a 1/3 discount. What is the new price?",
      "A swimming pool is 25m long. To swim 1km, how many lengths are needed?",
      "A family needs £200 for a day out. They have £155.50. How much more do they need?",
      "A garden is a rectangle 10m long with a perimeter of 34m. What is its area?",
      "A recipe for 12 cupcakes needs 150g of sugar. How much sugar for 24 cupcakes?",
      "A car journey is 5km. How many metres is this?",
      "A 1 litre carton of juice costs £1.20. A 2 litre bottle costs £2.20. Which is better value?",
      "A school fair raises £546. The money is shared equally between 6 charities. How much does each charity receive?",
      "A room is 5m by 4m. A rug of 3m by 2m is placed on the floor. What area of floor is not covered?",
      "A cyclist travels at 15km per hour. How far do they travel in 2 hours?",
      "A pack of 6 yoghurts costs £1.80. What is the cost of one yoghurt?",
      "A flight leaves at 10:45 and is 2 hours 30 minutes long. What time does it arrive?",
      "A T-shirt costs £8.99. In a sale, it is half price. What is the sale price?",
      "A rectangular field has an area of 200m². Its length is 20m. What is its perimeter?",
      "A machine produces 120 toys per hour. How many toys does it produce in 8 hours?",
      "Convert 3.5kg to grams.",
      "A bottle of water holds 750ml. How many bottles would be needed to fill a 3-litre container?",
      "A school concert starts at 18:00 and lasts for 1 hour and 40 minutes. What time does it finish?",
      "A book costs £7.50. What is the cost of 5 books?",
      "A fence is made of panels 2m wide. How many panels for a fence 30m long?",
      "A bag of apples weighs 1.2kg. If there are 8 apples in the bag, what is the average weight of one apple?",
      "How many minutes are in 3.25 hours?",
      "A box of 12 pencils costs £2.40. A box of 8 crayons costs £1.84. Which is cheaper per item?",
      "The perimeter of a square is 36cm. What is its area?",
      "A recipe for 8 people requires 400ml of cream. How much cream is needed for 6 people?",
      "A journey is 40 miles. The car travels at 20 mph. How long does the journey take?",
      "A 2.5 litre bottle of paint is needed for a wall. The paint is sold in 1 litre tins. How many tins must be bought?"
    ],
    "Year 5": [
      "A jacket costs £45.50. In a sale, it is reduced by 20%. What is the new price?",
      "The distance from London to Paris is approximately 450km. A train travels at an average speed of 150km/h. How long will the journey take?",
      "A box of 8 apples weighs 1.2kg. What is the approximate weight of one apple in grams?",
      "A rectangular garden is 12m long and 8m wide. What is its area? If fencing costs £10 per metre, how much will it cost to fence the entire garden?",
      "A car's fuel tank has a capacity of 40 litres. If petrol costs £1.50 per litre, how much does it cost to fill the tank from empty?",
      "A car travels 300km and uses 25 litres of petrol. How many kilometres per litre does the car achieve?",
      "A garden measuring 15m by 20m needs to be seeded. One box of seed covers 50m². How many boxes are needed?",
      "A 2.5kg chicken needs to be cooked for 40 minutes per kg. How long should it be cooked for?",
      "A plank of wood is 5.2m long. A carpenter cuts it into 4 equal pieces. How long is each piece in centimetres?",
      "A taxi costs £3 plus £1.50 per mile. How much would a 6-mile journey cost?",
      "A rectangular fish tank is 80cm long, 40cm wide and 50cm high. What is its volume in litres?",
      "A recipe uses 150g sugar for every 250g of flour. If you use 750g of flour, how much sugar do you need?",
      "A runner's average speed is 12km/h. How far can they run in 2.5 hours?",
      "A phone contract costs £15 a month and includes 5GB of data. Extra data is £3 per GB. One month the bill is £24. How much extra data was used?",
      "A fence is built from panels 1.8m wide. How many panels are needed for a fence 27m long?",
      "A 5-litre container of paint is used to paint a wall with an area of 60m². How many millilitres of paint are used per square metre?",
      "A block of cheese weighing 1.2kg costs £9. What is the price per 100g?",
      "A cyclist travels 45km in 3 hours. What is their average speed in km/h?",
      "A water butt collects 5 litres of water every hour during a storm. If it has a capacity of 150 litres and was empty, how long would it take to fill?",
      "A shop sells T-shirts for £8 each or 3 for £20. How much do you save by buying 3 together?",
      "A room needs a new skirting board. The room is a rectangle 4.5m by 3.2m with a doorway 0.8m wide. What length of skirting board is needed?",
      "An empty suitcase weighs 2.8kg. After packing, it weighs 15.5kg. What is the mass of the contents?",
      "A machine fills 12 bottles of juice every minute. Each bottle holds 500ml. How many litres of juice does it bottle in an hour?",
      "A map has a scale of 1cm to 5km. A road on the map is 6.5cm long. What is the actual length of the road?",
      "You have a budget of £100 for a party. Venue hire is £45, food is £3.50 per person. What is the maximum number of people you can invite?",
      "A car is worth £8000. It loses 10% of its value in a year. What is it worth after a year?",
      "A train travels 200 miles in 2.5 hours. What is its average speed in mph?",
      "A recipe for 12 biscuits needs 200g of flour. You have 1kg of flour. How many biscuits can you make?",
      "The perimeter of a rectangular field is 240m. The length is twice the width. What are the dimensions?",
      "Petrol costs £1.45 per litre. A car's tank holds 50 litres. How much does it cost to fill the tank from empty?",
      "A cuboid has a volume of 120cm³. It is 10cm long and 4cm wide. What is its height?",
      "A recipe uses butter and sugar in the ratio 2:3. If you use 150g of sugar, how much butter do you need?",
      "An athlete runs 100m in 12.5 seconds. What is their speed in metres per second?",
      "A phone bill is £20 plus 10p per minute for calls outside the plan. If a person makes 30 minutes of extra calls, what is the bill?",
      "A fence is made of 15 panels, each 2.2m long. What is the total length of the fence?",
      "A 2 litre carton of orange juice costs £2.50. A 750ml bottle costs 90p. Which is better value per litre?",
      "A cheese costs £8.50 per kg. What is the cost of a 300g piece?",
      "A cyclist wants to travel 100km. They cycle at an average speed of 20km/h. How long will the journey take?",
      "A water tank is 80% full. Its capacity is 500 litres. How many litres are in the tank?",
      "A concert ticket costs £35. A booking fee of 5% is added. What is the total price?",
      "A composite L-shaped room needs a new carpet. The room's dimensions are given. Calculate the area of carpet needed.",
      "A parcel weighs 3.45kg. Postage costs £5 for the first kg and £1.50 for each additional kg. What is the postage cost?",
      "A machine prints 150 pages in 5 minutes. How many pages does it print per minute?",
      "A map scale is 1:50,000. The distance on the map is 4cm. What is the real distance in km?",
      "A budget for a project is £5000. 45% is spent on materials. How much money is left for labour?",
      "A car's value decreases by 15% from £12,000. What is its new value?",
      "An object travels at 60 mph. How many miles does it travel in 20 minutes?",
      "A bag contains red and blue sweets in the ratio 3:4. If there are 12 blue sweets, how many red sweets are there?",
      "The perimeter of an isosceles triangle is 30cm. The two equal sides are 12cm long. What is the length of the base?",
      "A builder mixes 1 part cement with 4 parts sand. If he has 20kg of sand, how much cement does he need?"
    ],
    "Year 6": [
      "A tin of beans weighs 450g. The tins are sold in packs of 4. What is the weight of 3 packs in kilograms?",
      "A room is 5m long, 4m wide, and 2.5m high. What is its volume?",
      "A recipe for a fruit smoothie requires 250ml of orange juice, 150ml of mango juice, and 100ml of pineapple juice. If you want to make 2 litres of the smoothie for a party, how much orange juice will you need?",
      "A map has a scale of 1:50,000. The distance between two towns on the map is 10cm. What is the actual distance in kilometres?",
      "A jug of squash is made by mixing 1 part concentrate to 4 parts water. If you use 300ml of concentrate, how much squash will you have in total, in litres?",
      "A car is travelling at 70 mph. How far will it travel in 2 hours and 30 minutes?",
      "The area of a triangular garden is 50m². Its base is 20m. What is its height?",
      "A currency exchange rate is £1 = €1.15. How many euros would you get for £250?",
      "A recipe for 12 cakes needs 200g flour, 150g sugar and 100g butter. How much of each ingredient is needed for 18 cakes?",
      "A 10kg bag of potatoes costs £4.50. A 2.5kg bag costs £1.20. Which is better value per kg?",
      "The volume of a cuboid is 240cm³. Its length is 10cm and its height is 8cm. What is its width?",
      "A map scale is 1:50,000. The distance between two towns on the map is 7cm. What is the actual distance in kilometres?",
      "A mobile phone costs £600, or a payment plan of £50 deposit plus 12 monthly payments of £50. How much more expensive is the payment plan?",
      "A train leaves at 09:45 and arrives at 12:15. It travels 150 miles. What is its average speed in miles per hour?",
      "A company makes a profit of £2.5 million. It has 50 employees and wants to give 10% of the profit as a bonus, shared equally. How much does each employee get?",
      "A parallelogram has an area of 48cm² and a base of 12cm. What is its perpendicular height?",
      "A builder mixes cement, sand and gravel in the ratio 1:2:4. If he uses 15kg of cement, how much sand and gravel does he need?",
      "A water tank in the shape of a cuboid is 2m x 1.5m x 1m. It is 75% full. How many litres of water are in the tank?",
      "A plane flies 800km in 1 hour 15 minutes. What is its average speed in km/h?",
      "Interest on savings is 2% per year. If you have £500 in a savings account, how much interest will you earn in one year?",
      "A cube has a volume of 64cm³. What is the area of one of its faces?",
      "Three builders can build a wall in 10 days. Assuming they work at the same rate, how long would it take 5 builders?",
      "The diameter of a circle is 10cm. What is its circumference?",
      "A recipe is in imperial units, asking for 2lbs of flour. Your scales are metric. How many grams do you need?",
      "A car depreciates in value by 20% in its first year. If it cost £15,000 new, what is its value after one year?",
      "A £80 coat is in a sale with 25% off. What is the sale price?",
      "The ratio of boys to girls in a school is 4:5. If there are 200 boys, how many girls are there?",
      "A car travels 30 miles on 1 gallon of petrol. Petrol costs £6.50 per gallon. How much does a 150-mile journey cost?",
      "The area of a circle is approximately 78.5cm². What is its radius? (A = πr²)",
      "A recipe for 6 people needs 300g of pasta. How much pasta is needed for 10 people?",
      "A cuboid has a volume of 0.5m³. How many litres is this?",
      "A map has a scale of 1 inch to 5 miles. The distance on the map is 3.5 inches. What is the real distance?",
      "A bank offers 1.5% annual interest. If you save £2000 for a year, how much interest do you earn?",
      "Two numbers are in the ratio 3:7. Their sum is 50. What are the numbers?",
      "The circumference of a wheel is 80cm. How many full rotations does it make over a distance of 1km?",
      "A shop buys a TV for £400 and sells it for a 30% profit. What is the selling price?",
      "The angles in a triangle are in the ratio 1:2:3. What are the sizes of the angles?",
      "A car is travelling at 30 metres per second. What is this speed in km/h?",
      "The volume of a cube is 216cm³. What is the length of one of its sides?",
      "An item costs £50 plus 20% VAT. What is the total price?",
      "The exchange rate is $1.25 to £1. How many pounds is $200?",
      "The area of a parallelogram is 60cm². Its base is 1.5 times its height. Find the base and height.",
      "A group of 5 people can paint a fence in 4 hours. How long would it take 2 people?",
      "The diameter of the Earth is approximately 12,742 km. What is its circumference?",
      "A company's shares are worth £2.50 each. They increase in value by 8%. What is the new price?",
      "In a survey of 120 people, the ratio of people who prefer tea to coffee is 3:2. How many people prefer tea?",
      "A car travels 210 miles in 3 hours and 30 minutes. What was its average speed?",
      "A cylinder has a volume of 314cm³. Its height is 10cm. What is the radius of its base? (V=πr²h)",
      "An investment of £1000 increases by 10% in the first year, and then the new amount increases by 10% in the second year. What is the final value?",
      "The scale on a model boat is 1:50. The model is 40cm long. What is the real length of the boat in metres?"
    ]
  }
}
